{
    "title": "fdrtd - federated secure computing",
    "soon_tm": "(Diese Seite ist ein Platzhalter. Der eigentliche Inhalt folgt in den nächsten Tagen.)",
    "toc": "Inhaltsverzeichnis",

    "404_not_found": "404 Seite nicht gefunden",

    "general_source": "Quelle",
    "general_imagecredit": "Bildnachweis",

    "previous_topic": "Vorheriges Thema",
    "next_topic": "Nächstes Thema",

    "nav_users": "Für Nutzer",
    "nav_users_benefit": "Vorteile",
    "nav_users_journey": "User Journey",
    "nav_users_usecases": "Fallbeispiele",
    "nav_users_solutions": "Lösungen",
    "nav_users_support": "Support",
    "nav_users_start": "Starten Sie mit uns",
    
    "nav_supporters": "Für Unterstützer",
    "nav_supporters_opportunity": "Problemstellung",
    "nav_supporters_value": "Value Proposition",
    "nav_supporters_magic": "Underlying Magic",
    "nav_supporters_impact": "Impact & Skalierung",
    "nav_supporters_milestones": "Meilensteine",
    "nav_supporters_work": "Arbeiten Sie mit uns",
    
    "nav_contributors": "Für Kontributoren",
    "nav_contributors_beliefs": "Unsere Überzeugungen",
    "nav_contributors_mission": "Unsere Mission",
    "nav_contributors_todo": "Arbeitspakete",
    "nav_contributors_resources": "Ressourcen",
    "nav_contributors_rules": "Regeln & Empfehlungen",
    "nav_contributors_join": "Treten Sie dem Team bei",
    
    "nav_technology": "Unsere Technologie",
    "nav_technology_federated": "<fdrtd>Federated Secure Computing</fdrtd>",
    "nav_technology_design": "Design-Highlights",
    "nav_technology_clientserver": "Client-Server-Architektur",
    "nav_technology_microservices": "Schnelle schlanke Microservices",
    "nav_technology_platform": "Plattform & Ökosystem",
    "nav_technology_cloud": "Bereit für Cloud & IoT",

    "nav_solution": "Unsere Lösung",
    "nav_solution_fdrtd": "<fdrtd>fdrtd & fdrtd server</fdrtd>",
    "nav_solution_protocols": "Unterstützte Protokolle",
    "nav_solution_usecases": "Unterstützte Anwendungen",
    "nav_solution_features": "Eingebaute Features",
    "nav_solution_plugandplay": "Plug & Play Erweiterbarkeit",
    "nav_solution_foss": "Free & Quelloffen",

    "nav_project": "Unser Projekt",
    "nav_project_news": "Neuigkeiten",
    "nav_project_acknowledgements": "Danksagung",
    "nav_project_faq": "Häufig gestellte Fragen",
    "nav_project_media": "Presse & Medien",
    "nav_project_about": "Über uns",
    "nav_project_contact": "Kontakt",

    "nav_docs": "<fdrtd>Dokumentation für Entwickler</fdrtd>",

    "nav_github": "<fdrtd>Source Code auf GitHub</fdrtd>",

    "nav_language_select": "Sprache",
    "nav_language_en": "Englisch",
    "nav_language_de": "Deutsch",
    "nav_language_hi": "Hindi",

    "nav_theme": "Darstellung",
    "nav_theme_dark": "dunkel",
    "nav_theme_light": "hell",
    "nav_theme_highcontrast": "kontrastreich",

    "nav_legal": "Gesetzliche Hinweise",
    "nav_legal_privacy": "Datenschutz",
    "nav_legal_contact": "Impressum",



    "welcome": "Willkommen",

    "elevatorpitch": "Elevator Pitch",
    "elevatorpitch_why": "<em>WARUM // </em>Wir wollen Awareness schaffen, dass digitale Zusammenarbeit auch ohne Austausch von Daten möglich ist, mittels moderner Kryptographie ('privacy preserving computation'). Wir wollen Ihnen helfen, den maximalen Wert Ihrer Daten zu heben und gleichzeitig die volle Kontrolle, Besitz und Handlungshoheit zu bewahren. Wir möchten Eintrittsbarrieren abbauen und allen ermöglichen, diese Technologien zu nutzen, indem wir die Schwierigkeiten und die Komplexität beseitigen, die bisher mit der Integration von Kryptographie in die Anwendungsentwicklung einherging.",
    "elevatorpitch_how": "<em>WIE // </em>Unsere innovative Architektur <fdrtd>Federated Secure Computing</fdrtd> lässt sie auf einfache Weise verteilte Anwendungen klientenseitig entwickeln, während die gesamte komplexe und rechenaufwändige Kryptographie serverseitig ausgelagert wird. Die Architektur basiert auf schnellen und schlanken Microservices und wird durch einen Open API 3.0 Standard beschrieben. Als eine plug &amp; und technologieoffene Platform, orchestriert sie verschiedene Protokolle mit und ohne zentrale Instanz (z.B. Homomorphic Encryption oder Secure Multiparty Computation).",
    "elevatorpitch_what": "<em>WAS // </em>Um Ihnen einen schnellen Start zu ermöglichen, stellen wir <fdrtd>fdrtd</fdrtd> (lies: federated) bereit, eine freie und quelloffene Bibliothek. Sie läuft nahezu überall, on premises, in der Cloud und auf dem kleinsten IoT Device. Mit ihr können sie sich mit Ihren Kooperationspartnern vernetzen unabhängig von deren Wahl eines Betriebssystems, einer Programmiersprache oder eines Technologie-Stacks. Die Bibliothek stellt einfache Referenz-Implementierungen einiger Kryptographie-Protokoller und Anwendungs-Microservices bereit.",
    "elevatorpitch_who": "<em>WER // </em>Ihr Interesse steht im Mittelpunkt. Wir wollen alle, seien es Institutionen, Unternehmen oder Privatleute, in die Lage versetzen, großartige verteilte Anwendungen zu entwickeln. Wir wollen eine Community von Anwenderinnen und Entwickerinnen schaffen, um sich auszutauschen und voneinander zu lernen. Ob Sie die Daten Ihrer Kunden schützen wollen, Ihre Attack Surface verringern wollen, oder die verteilten Anwendungen der nächsten Generation designen, wir sind hier um zu helfen. Wir freuen uns über Ihre Anwendungsfälle, unabhängig von Industrie und Funktion, und wir möchten Ihnen helfen, sichtbare Show Cases zu schaffen. Wenn Sie unsere bescheidenen Anfänge vorranbringen können, dann begrüßen wir Sie als Kontributorinnen unseres Open Source Projektes. Machen Sie mit.",


    
    "legal_privacy_heading": "Datenschutzerklärung",
    "legal_privacy_a": "Personenbezogene Daten",
    "legal_privacy_a1": "Personenbezogene Daten (nachfolgend zumeist nur „Daten“ genannt) werden von uns nur im Rahmen der Erforderlichkeit sowie zum Zwecke der Bereitstellung eines funktionsfähigen und nutzerfreundlichen Internetauftritts, inklusive seiner Inhalte und der dort angebotenen Leistungen, verarbeitet.",
    "legal_privacy_a2": "Gemäß Art. 4 Ziffer 1. der Verordnung (EU) 2016/679, also der Datenschutz-Grundverordnung (nachfolgend nur „DSGVO“ genannt), gilt als „Verarbeitung“ jeder mit oder ohne Hilfe automatisierter Verfahren ausgeführter Vorgang oder jede solche Vorgangsreihe im Zusammenhang mit personenbezogenen Daten, wie das Erheben, das Erfassen, die Organisation, das Ordnen, die Speicherung, die Anpassung oder Veränderung, das Auslesen, das Abfragen, die Verwendung, die Offenlegung durch Übermittlung, Verbreitung oder eine andere Form der Bereitstellung, den Abgleich oder die Verknüpfung, die Einschränkung, das Löschen oder die Vernichtung.",
    "legal_privacy_a3": "Mit der nachfolgenden Datenschutzerklärung informieren wir Sie insbesondere über Art, Umfang, Zweck, Dauer und Rechtsgrundlage der Verarbeitung personenbezogener Daten, soweit wir entweder allein oder gemeinsam mit anderen über die Zwecke und Mittel der Verarbeitung entscheiden. Zudem informieren wir Sie nachfolgend über die von uns zu Optimierungszwecken sowie zur Steigerung der Nutzungsqualität eingesetzten Fremdkomponenten, soweit hierdurch Dritte Daten in wiederum eigener Verantwortung verarbeiten.",
    "legal_privacy_a4": "Unsere Datenschutzerklärung ist wie folgt gegliedert:",
    "legal_privacy_b": "I. Informationen über uns als Verantwortliche",
    "legal_privacy_b1": "Verantwortlicher Anbieter dieses Internetauftritts im datenschutzrechtlichen Sinne ist:",
    "legal_privacy_b2": "bytes for life GmbH",
    "legal_privacy_b3": "Kaulbachstraße 61a",
    "legal_privacy_b4": "80539 München",
    "legal_privacy_b5": "Deutschland",
    "legal_privacy_b6": "Telefon: 0176 – 38 23 92 81",
    "legal_privacy_b7": "E-Mail:",
    "legal_privacy_b8": "Internetauftritt:",
    "legal_privacy_c": "II. Rechte der Nutzer und Betroffenen",
    "legal_privacy_c1": "Mit Blick auf die nachfolgend noch näher beschriebene Datenverarbeitung haben die Nutzer und Betroffenen das Recht",
    "legal_privacy_c2": "auf Bestätigung, ob sie betreffende Daten verarbeitet werden, auf Auskunft über die verarbeiteten Daten, auf weitere Informationen über die Datenverarbeitung sowie auf Kopien der Daten (vgl. auch Art. 15 DSGVO);",
    "legal_privacy_c3": "auf Berichtigung oder Vervollständigung unrichtiger bzw. unvollständiger Daten (vgl. auch Art. 16 DSGVO);",
    "legal_privacy_c4": "auf unverzügliche Löschung der sie betreffenden Daten (vgl. auch Art. 17 DSGVO), oder, alternativ, soweit eine weitere Verarbeitung gemäß Art. 17 Abs. 3 DSGVO erforderlich ist, auf Einschränkung der Verarbeitung nach Maßgabe von Art. 18 DSGVO;",
    "legal_privacy_c5": "auf Erhalt der sie betreffenden und von ihnen bereitgestellten Daten und auf Übermittlung dieser Daten an andere Anbieter/Verantwortliche (vgl. auch Art. 20 DSGVO);",
    "legal_privacy_c6": "auf Beschwerde gegenüber der Aufsichtsbehörde, sofern sie der Ansicht sind, dass die sie betreffenden Daten durch den Anbieter unter Verstoß gegen datenschutzrechtliche Bestimmungen verarbeitet werden (vgl. auch Art. 77 DSGVO).",
    "legal_privacy_c7": "Darüber hinaus ist der Anbieter dazu verpflichtet, alle Empfänger, denen gegenüber Daten durch den Anbieter offengelegt worden sind, über jedwede Berichtigung oder Löschung von Daten oder die Einschränkung der Verarbeitung, die aufgrund der Artikel 16, 17 Abs. 1, 18 DSGVO erfolgt, zu unterrichten. Diese Verpflichtung besteht jedoch nicht, soweit diese Mitteilung unmöglich oder mit einem unverhältnismäßigen Aufwand verbunden ist. Unbeschadet dessen hat der Nutzer ein Recht auf Auskunft über diese Empfänger.",
    "legal_privacy_c8": "Ebenfalls haben die Nutzer und Betroffenen nach Art. 21 DSGVO das Recht auf Widerspruch gegen die künftige Verarbeitung der sie betreffenden Daten, sofern die Daten durch den Anbieter nach Maßgabe von Art. 6 Abs. 1 lit. f) DSGVO verarbeitet werden. Insbesondere ist ein Widerspruch gegen die Datenverarbeitung zum Zwecke der Direktwerbung statthaft.",
    "legal_privacy_d": "III. Informationen zur Datenverarbeitung",
    "legal_privacy_d1": "Ihre bei Nutzung unseres Internetauftritts verarbeiteten Daten werden gelöscht oder gesperrt, sobald der Zweck der Speicherung entfällt, der Löschung der Daten keine gesetzlichen Aufbewahrungspflichten entgegenstehen und nachfolgend keine anderslautenden Angaben zu einzelnen Verarbeitungsverfahren gemacht werden.",
    "legal_privacy_d2": "Serverdaten",
    "legal_privacy_d3": "Aus technischen Gründen, insbesondere zur Gewährleistung eines sicheren und stabilen Internetauftritts, werden Daten durch Ihren Internet-Browser an uns bzw. an unseren Webspace-Provider übermittelt. Mit diesen sog. Server-Logfiles werden u.a. Typ und Version Ihres Internetbrowsers, das Betriebssystem, die Website, von der aus Sie auf unseren Internetauftritt gewechselt haben (Referrer URL), die Website(s) unseres Internetauftritts, die Sie besuchen, Datum und Uhrzeit des jeweiligen Zugriffs sowie die IP-Adresse des Internetanschlusses, von dem aus die Nutzung unseres Internetauftritts erfolgt, erhoben.",
    "legal_privacy_d4": "Diese so erhobenen Daten werden vorrübergehend gespeichert, dies jedoch nicht gemeinsam mit anderen Daten von Ihnen.",
    "legal_privacy_d5": "Diese Speicherung erfolgt auf der Rechtsgrundlage von Art. 6 Abs. 1 lit. f) DSGVO. Unser berechtigtes Interesse liegt in der Verbesserung, Stabilität, Funktionalität und Sicherheit unseres Internetauftritts.",
    "legal_privacy_d6": "Die Daten werden spätestens nach sieben Tage wieder gelöscht, soweit keine weitere Aufbewahrung zu Beweiszwecken erforderlich ist. Andernfalls sind die Daten bis zur endgültigen Klärung eines Vorfalls ganz oder teilweise von der Löschung ausgenommen.",
    "legal_privacy_d7": "Cookies",
    "legal_privacy_d8": "Dieser Internetauftritt verwendet keine sog. Cookies.",
    "legal_privacy_d9": "Kontaktanfragen / Kontaktmöglichkeit",
    "legal_privacy_d10": "Sofern Sie per Kontaktformular oder E-Mail mit uns in Kontakt treten, werden die dabei von Ihnen angegebenen Daten zur Bearbeitung Ihrer Anfrage genutzt. Die Angabe der Daten ist zur Bearbeitung und Beantwortung Ihre Anfrage erforderlich – ohne deren Bereitstellung können wir Ihre Anfrage nicht oder allenfalls eingeschränkt beantworten.",
    "legal_privacy_d11": "Rechtsgrundlage für diese Verarbeitung ist Art. 6 Abs. 1 lit. b) DSGVO.",
    "legal_privacy_d12": "Ihre Daten werden gelöscht, sofern Ihre Anfrage abschließend beantwortet worden ist und der Löschung keine gesetzlichen Aufbewahrungspflichten entgegenstehen, wie bspw. bei einer sich etwaig anschließenden Vertragsabwicklung.",
    "legal_privacy_footer": "Diese Datenschutzerklärung beruht auf der <elink>https://www.ratgeberrecht.eu/leistungen/muster-datenschutzerklaerung.html§Muster-Datenschutzerklärung</elink> der <elink>https://www.ratgeberrecht.eu§Anwaltskanzlei Weiß & Partner</elink>.",
    "legal_privacy_footer1": "Muster-Datenschutzerklärung",
    "legal_privacy_footer2": "Anwaltskanzlei Weiß & Partner",

    "legal_contact_heading": "Impressum",
    "legal_contact_a": "Angaben gemäß §5 Telemediengesetz",
    "legal_contact_a1": "bytes for life GmbH",
    "legal_contact_a2": "Kaulbachstraße 61a",
    "legal_contact_a3": "80539 München",
    "legal_contact_a4": "Deutschland",
    "legal_contact_a5": "Telefon: 0176 – 38 23 92 81",
    "legal_contact_a6": "E-Mail:",
    "legal_contact_a7": "Internetauftritt:",
    "legal_contact_a8": "Registergericht, Registernummer",
    "legal_contact_a9": "Amtsgericht München, HRB 262175",
    "legal_contact_a10": "Vertretungsberechtigter Geschäftsführer",
    "legal_contact_a11": "Dr. Hendrik Ballhausen",
    "legal_contact_a12": "Umsatzsteuer-Identifikationsnummer §27 UStG",
    "legal_contact_a13": "DE 338 44 66 35"
}
