{
    "title": "fdrtd - federated secure computing",
    
    "404_not_found": "404 page not found",
    "soon_tm": "(this is a placeholder page. content is to follow in the coming days.)",
    "toc": "table of contents",

    "general_source": "source",
    "general_imagecredit": "image credit",

    "previous_topic": "previous topic",
    "next_topic": "next topic",

    "nav_users": "for users",
    "nav_users_benefit": "key benefits",
    "nav_users_journey": "user journey",
    "nav_users_usecases": "use cases",
    "nav_users_solutions": "solutions",
    "nav_users_support": "support",
    "nav_users_start": "how to start",
    
    "nav_supporters": "for supporters",
    "nav_supporters_opportunity": "problem & opportunity",
    "nav_supporters_value": "value proposition",
    "nav_supporters_magic": "underlying magic",
    "nav_supporters_impact": "creating impact & scaling",
    "nav_supporters_milestones": "milestones & next steps",
    "nav_supporters_work": "work with us",
    
    "nav_contributors": "for contributors",
    "nav_contributors_beliefs": "our beliefs",
    "nav_contributors_mission": "our mission",
    "nav_contributors_todo": "work packages",
    "nav_contributors_resources": "resources",
    "nav_contributors_rules": "rules & guidelines",
    "nav_contributors_join": "join the team",
    
    "nav_technology": "our technology",
    "nav_technology_federated": "<fdrtd>federated secure computing</fdrtd>",
    "nav_technology_design": "design highlights",
    "nav_technology_clientserver": "client & server architecture",
    "nav_technology_microservices": "fast & lean microservices",
    "nav_technology_platform": "platform & ecosystem",
    "nav_technology_cloud": "ready for cloud & IoT",

    "nav_solution": "our solution",
    "nav_solution_fdrtd": "<fdrtd>fdrtd & fdrtd server</fdrtd>",
    "nav_solution_protocols": "supported protocols",
    "nav_solution_usecases": "supported use cases",
    "nav_solution_features": "built-in features",
    "nav_solution_plugandplay": "plug & play extensibility",
    "nav_solution_foss": "free & open source",

    "nav_project": "our project",
    "nav_project_news": "news",
    "nav_project_acknowledgements": "acknowledgements",
    "nav_project_faq": "frequently asked questions",
    "nav_project_media": "press & media",
    "nav_project_about": "about us",
    "nav_project_contact": "contact",

    "nav_docs": "<fdrtd>documentation for developers</fdrtd>",

    "nav_github": "<fdrtd>source code on GitHub</fdrtd>",

    "nav_clientside": "client-side development",
    "nav_clientside_explanation": "explanation",
    "nav_clientside_tutorials": "tutorials",
    "nav_clientside_howto": "how-to guides",
    "nav_clientside_reference": "reference",
    "nav_clientside_library": "microservice library",
    "nav_clientside_apibrowser": "API browser",

    "nav_serverside": "server-side development",
    "nav_serverside_explanation": "explanation",
    "nav_serverside_tutorials": "tutorials",
    "nav_serverside_howto": "how-to guides",
    "nav_serverside_reference": "reference",
    "nav_serverside_stub": "server stub",
    "nav_serverside_devsecops": "dev-sec-ops",

    "nav_language_select": "language",
    "nav_language_en": "English",
    "nav_language_de": "German",

    "nav_theme": "theme",
    "nav_theme_dark": "dark mode",
    "nav_theme_light": "day mode",
    "nav_theme_highcontrast": "high contrast",

    "nav_legal": "legal",
    "nav_legal_privacy": "privacy",
    "nav_legal_contact": "contact",



    "welcome": "welcome",

    "elevatorpitch": "elevator pitch",
    "elevatorpitch_why": "<em>WHY // </em>we want to create awareness that digital collaboration is possible without data sharing through modern cryptography ('privacy preserving computation'). we want to help you leverage the full value of your data while retaining full control, ownership, and agency. we want to reduce barriers and empower everyone by removing the traditional overhead and complexity of integrating cryptography with application development.",
    "elevatorpitch_how": "<em>HOW // </em>our innovative architecture <fdrtd>Federated Secure Computing</fdrtd> lets you easily design distributed application client-side, while offloading all of the difficult and computing intensive cryptography server-side. it is based on fast and lean microservices and is described by a Open API 3.0 standard. as a plug &amp; play open technology platform, it orchestrates various protocols with or without a central 3rd party (e.g. homomorphic encryption or secure multiparty computation).",
    "elevatorpitch_what": "<em>WHAT // </em>to get you jump started, we provide <fdrtd>fdrtd</fdrtd> (read: federated), a free and open source library. it runs just about anywhere, on premises, in the cloud or on the smallest IoT device. it lets you connect with your collaborators irrespective of their choice of operating system, programming language or technology stack. it provides simple reference implementations for various crypto protocols and application microservices.",
    "elevatorpitch_who": "<em>WHO // </em>this is about you. we want to empower everyone, be it institutions, corporations, or individuals, to build and run great distributed applications. we want to create a community of users and developers to exchange and learn. whether you want to protect your customers' data, shrink your attack surface, or design next-generation distributed apps, we are here to help you. we welcome your use cases, irrespective of industry and function, and help you create visible show cases. if you want to improve on our humble beginnings, we welcome you as a contributor of our open source project. join us.",



    "users_benefit": "key benefits",
    "users_benefit_empowerment": "<em>empowerment</em>",
    "users_benefit_empowerment1": "we want everyone, not only cryptography experts, to be able to design, develop, deploy and manage secure distributed applications.",
    "users_benefit_empowerment1a": "<em>junior skills:</em> for client-side development, very basic programming skills suffice. client-side developers do not deal with cryptography at all.",
    "users_benefit_empowerment1b": "<em>choose your tools:</em> use whatever programming language you prefer, choose your own tech stack, bring your own toolsets. they will be fine.",
    "users_benefit_empowerment1c": "<em>for education:</em> our simple solution is well suited for propaedeutic exploration, student projects, and citizen science. learn privacy by doing.",
    "users_benefit_convenience": "<em>convenience</em>",
    "users_benefit_convenience1": "our technology is not yet another privacy-preserving computation framework. rather, it is a convenient middleware to run existing frameworks in the simplest manner possible:",
    "users_benefit_convenience1a": "<em>separation of concerns:</em> a client-server architecture separates the business logic (client-side) from the computing intensive cryptography (server-side).",
    "users_benefit_convenience1b": "<em>transparency:</em> application developers interact through a transparent and minimal API. control flow and data flow in peer-to-peer protocols remain transparent.",
    "users_benefit_convenience1c": "<em>efficiency:</em> lean and fast microservices cater to actual computing needs, without the bloat of universal monolithic solutions.",
    "users_benefit_convenience1d": "<em>ease of use:</em> in a modern DevSecOps and CI/CD approach, designing, implementing, deploying and managing a solution becomes easy and straightforward.",
    "users_benefit_compatibility": "<em>compabibility & interoperability</em>",
    "users_benefit_compatibility1": "compabibility & interoperability",
    "users_benefit_compatibility1a": "<em>standardized:</em> a free OpenAPI 3.0 standard defines the interface while remaining technology neutral and open for any protocol and 3rd party vendors.",
    "users_benefit_compatibility1b": "<em>runs everywhere:</em> our solution is not dependent on any tech stack, but runs everywhere, from a large cloud infrastructure to on-premises data centers, from workstations to laptops, from smartphones to IoT devices.",
    "users_benefit_compatibility1c": "<em>easy to integrate:</em> our solution may be implemented step by step, microservice by microservice, both greenfield or into existing legacy codebase.",

    "users_journey": "user journey",
    "users_journey_ppc": "the promise of privacy-preserving computation",
    "users_journey_ppc1": "the user journey starts when an institution, business, or a group of individuals seek to design their digital collaboration in a more privacy-friendly way.",
    "users_journey_ppc2": "with some luck, these users will discover 'privacy-preserving computation', a family of modern technologies based on encryption and decentralized peer-to-peer-protocols, such as <elink>https://en.wikipedia.org/wiki/Secure_multi-party_computation§secure multiparty computation</elink> or <elink>https://en.wikipedia.org/wiki/Homomorphic_encryption§homomorphic encryption</elink>.",
    "users_journey_ppc3": "see, for example",
    "users_journey_ppc4a": "<elink>https://www.accenture.com/us-en/insights/digital/maximize-collaboration-secure-data-sharing§Maximize collaboration through secure data sharing</elink>: a report by Accenture",
    "users_journey_ppc4b": "<elink>http://publications.officialstatistics.org/handbooks/privacy-preserving-techniques-handbook/UN%20Handbook%20for%20Privacy-Preserving%20Techniques.pdf§UN Handbook on Privacy-Preserving Computation Techniques</elink>: a report by the Privacy Preserving Techniques Task Team of the United Nations",
    "users_journey_ppc4c": "<elink>https://www.mpcalliance.org/§MPC alliance</elink>: an industry alliance of companies interested in secure multiparty computation",
    "users_journey_meeting": "privacy-preserving computation is difficult to own, not everyone is in favour",
    "users_journey_meeting1": "<em>CTO:</em> 'privacy-preserving computation technologies will allow us and our clients to freely and securely collaborate without sharing data.'",
    "users_journey_meeting2": "<em>CEO:</em> 'this is great. not only will it enable us to fully capture the value of our data, it will also solve many legal and privacy issues. any objections?'",
    "users_journey_meeting3": "<em>CIO:</em> 'we would have to rewrite major parts of our legacy codebase. we are lacking the skills and tools. it would break everything. I would not want to do this.'",
    "users_journey_roadblocks": "roadblocks & barriers to entry",
    "users_journey_roadblocks1": "users may find that privacy-preserving computation comes with a hefty bill of prerequisites and is everything but easy to implement and operate.",
    "users_journey_roadblocks2": "in fact, these are the most common concerns we have heard during interviews with potential users and the community in general:",
    "users_journey_requirements": "user requirements are quite reasonable",
    "users_journey_requirements1": "part of the problem stems from the fact that academic research into privacy-preserving computation has led to universal one-size-fits-all solutions which tend to be large and complex.",
    "users_journey_requirements2": "actual user requirements on the other hand are actually quite reasonable and could be acieved with much less overhead and complexity.",
    "users_journey_requirements3": "further talking to decision makers and stakeholders quickly revealed: what was available was quite different from what was really required:",
    "users_journey_requirements3a": "they want to solve <em>specific problems</em> and did not care about universality",
    "users_journey_requirements3b": "their problems are typically <em>quite simple</em> in algorithmic terms",
    "users_journey_requirements3c": "they do not have any crypto experts and rely on <em>generalist developers</em>",
    "users_journey_requirements3d": "their <em>data protection</em> officers are sceptical about novel methods",
    "users_journey_requirements3e": "they need a <em>precise standard</em> that could be referenced in legal documents",
    "users_journey_requirements3f": "they need a prototyping approach that was up to speed with their <em>CI/CD</em>",
    "users_journey_requirements3g": "they want a framework that was as <em>simple to operate</em> and straightforward to service",
    "users_journey_requirements3h": "they want to <em>collaborate</em> with others who have very different systems",
    "users_journey_requirements3i": "they want to choose <em>their own languages</em> and development environments",
    "users_journey_requirements3j": "they need the new methods to be integrated <em>step-by-step</em> into legacy code",
    "users_journey_approach": "a new approach",
    "users_journey_approach1": "<fdrtd>federated secure computing</fdrtd> is a technology designed along these requirements. it is a modern architecture based on fast and lean microservices to solve everyday problems in privacy-preserving computing.",
    "users_journey_approach2": "<fdrtd>fdrtd</fdrtd> is an open source reference implementation. the middleware lets users design distributed applications in a simple and easy way, and relegates all of the complex and difficult cryptography to the server or the cloud, where data protection is much easier to achieve, and computing power is abundant.",

    "users_usecases": "use cases",

    "users_solutions": "solutions",
    
    "users_support": "support",
    "users_support_a": "on GitHub",
    "users_support_a1": "something not working as expected? some great feature missing? found a bug?",
    "users_support_a2": "the best way to make the coding team aware is to create an issue on GitHub. everyone will be on board, and your suggestion can be discussed. even better, you and others can directly contribute to the code. creating an issue is the preferred way before sending a pull request.",
    "users_support_b": "by email",
    "users_support_b1": "need help with an on-premises installation? thinking about a new use case?",
    "users_support_b2": "if your question or problem does not concern everyone on the project, then the best way to get individual support is to send an email. our team is here to help, and you will usually get a response within 24 hours.",

    "users_start": "how to start",



    "supporters_problem": "problem/opportunity",
    "supporters_problem_a": "the opportunity: 'privacy-preserving computation' could enable cooperation and privacy at the same time",
    "supporters_problem_a1": "<em>situation: we all need data ...</em>",
    "supporters_problem_a1a": "data is the new oil that fuels industry 4.0. corporations, institutions, and individuals need data to make informed decisions. analytics and machine learning demand ever larger and interconnected data sets. the full value of data is economically, socially, and scientifically only captured if we may share, compare and combine our data with others.",
    "supporters_problem_a2": "<em>complication: ... but often we cannot simply share it</em>",
    "supporters_problem_a2a": "consumers are concerned about the <em>privacy</em> of their personal data.",
    "supporters_problem_a2b": "companies are increasingly aware of the competitive edge from data and analytics and are guarding their data as <em>business secrets</em>.",
    "supporters_problem_a2c": "policy makers are driven to improve <em>data protection standards</em> and increasingly regulate important use cases.",
    "supporters_problem_a2d": "as a consequence, there are many situations where would-be collaborators cannot, must not or do not want to share data with others and instead siloe it away. in such cases, <em>society, businesses and individuals fail to harvest the true value of their data</em>.",
    "supporters_problem_a3": "<em>resolution: cryptography and decentralization</em>",
    "supporters_problem_a3a": "it may sound like magic, but thanks to mathematics it is actually possible to <em>jointly compute on distributed proprietary data – without sharing any of it.</em>",
    "supporters_problem_a3b": "it is modern cryptography that reconciles the possibilities of collaboration with the demand for <em>security, control, and privacy</em>.",
    "supporters_problem_a3c": "data owners can jointly compute on their data sets while always retaining <em>full agency and custody</em> over their own data.",
    "supporters_problem_a3d": "with <em>reversibility and active consent</em>, new business models become possible while protecting personal data and trade secrets.",
    "supporters_problem_b": "cryptography offers both privacy and cooperation at the same time",
    "supporters_problem_c": "the challenge: the technology is hugely underused as there are massive barriers to entry",
    "supporters_problem_c1": "while the mathematics is known for several decades, there are a few reasons why <em>privacy-preserving computing is an underused technology</em>.",
    "supporters_problem_c2": "companies lack tools and skills, and there are <em>huge barriers to entry</em> in terms of devsecops.",
    "supporters_problem_c3": "talking to potential users, learning from their experience, and listening to their reservations, we identified a number of recurring <em>pain points</em>:",
    "supporters_problem_c4": "<em>lack of knowledge & skills</em>",
    "supporters_problem_c4a": "<em>not aware of:</em> the technology is known to but a few experts. there have been very few visible showcases.",
    "supporters_problem_c4b": "<em>too advanced:</em> the technology is developed mostly by academic cryptography researchers.",
    "supporters_problem_c4c": "<em>missing skills:</em> the technology is accessible only to very few technologically advanced start-ups and companies. implementation and operation require rare and exotic skills by senior developers.",
    "supporters_problem_c5": "<em>inconvenience</em>",
    "supporters_problem_c5a": "<em>intransparent:</em> monolithic black-box frameworks are hard to figure out und analyze.",
    "supporters_problem_c5b": "<em>complex:</em> universal solutions tend to be overcomplex and overkill for everyday problems.",
    "supporters_problem_c5c": "<em>difficult:</em> solutions in practise are difficult to develop and cumbersome to deploy and maintain.",
    "supporters_problem_c6": "<em>incompatibility</em>",
    "supporters_problem_c6a": "<em>not standardized:</em> there are no standard interfaces, and solutions are not compatible or interoperable among each other.",
    "supporters_problem_c6b": "<em>proprietary runtimes:</em> solutions typically require special runtimes and uncommon tech stacks.",
    "supporters_problem_c6c": "<em>hard to integrate:</em> military-grade encryption and distributed computing are difficult to integrate with everyday business logic and legacy code base.",

    "supporters_value": "value proposition",
    "supporters_value_painpoints": "addressing the pain points",
    "supporters_value_painpoints1": "<em>lack of knowledge & skills</em>",
    "supporters_value_painpoints1a": "<em>not aware of:</em> in a world first, we realized the first privacy-preserving computation with actual patient data. we envision use cases throughout industries and functions, and we spread the word.",
    "supporters_value_painpoints1b": "<em>too advanced:</em> we empower everyone, institutions, businesses, and individuals, to use privacy-preserving computation. we connect crypto experts as server-side providers with layman users client-side.",
    "supporters_value_painpoints1c": "<em>missing skills:</em> we provide clients in several programming languages, and we design an API that can be used by any junior developer, and even students and beginners.",
    "supporters_value_painpoints2": "<em>inconvenience</em>",
    "supporters_value_painpoints2a": "<em>intransparent:</em> we do away with monolithic universality and disentangle the frameworks into small and easy-to-understand microservices.",
    "supporters_value_painpoints2b": "<em>complex:</em> lean and fast microservices do one thing and do it well.",
    "supporters_value_painpoints2c": "<em>difficult:</em> all the difficult sytems and dependencies are moved server-side.",
    "supporters_value_painpoints3": "<em>incompatibility</em>",
    "supporters_value_painpoints3a": "<em>not standardized:</em> there is one standard. it is free, open, and completely generic, so everyone can implement their diverse protocols.",
    "supporters_value_painpoints3b": "<em>proprietary runtimes:</em> no more proprietary runtimes, no more dependencies, no more demanding tech stacks. just a web client.",
    "supporters_value_painpoints3c": "<em>hard to integrate:</em> by breaking the problem into micro-problems, even legacy codebase can be refactored, if need be.",
    "supporters_value_proposition": "key benefits",
    "supporters_value_beneficiaries": "everyone benefits",
    "supporters_value_beneficiaries1": "<em>developers</em> get a tool that empowers them to create modern and privacy-friendly solutions in an agile and efficient way",
    "supporters_value_beneficiaries2": "<em>scientists</em> gain access to vast pools of data from public and private sources, and individuals may contribute to science without donating their data",
    "supporters_value_beneficiaries3": "<em>companies</em> link their distributed and proprietary data to create superior analytics and team up even with their competitors to harvest the full value of their data",
    "supporters_value_beneficiaries4": "<em>policy makers</em> welcome a non-prohibitive way to improve agency and control over how sensitive and valuable data is handled in our society",
    "supporters_value_beneficiaries5": "<em>everyone</em> - e.g. consumers, patients - enjoys superior protection of their data",

    "supporters_magic": "underlying magic",

    "supporters_impact": "creating impact & scaling",

    "supporters_milestones": "milestones & next steps",

    "supporters_work": "work with us",



    "contributors_beliefs": "our beliefs",
    "contributors_beliefs_collaboration": "we believe that it is only through <em>collaboration, not isolation</em>, that society, researchers, corporations, and individuals will make best use of their proprietary data and capture their full value.",
    "contributors_beliefs_privacy": "we understand that <em>privacy-preserving computation</em> enables efficient collaboration while still preserving control, custody, trust, agency, consent, and privacy.",
    "contributors_beliefs_trabsformation": "we envision transformative use cases for <fdrtd>federated secure computing</fdrtd> throughout industries and practises, whenever one must not, want not or can not share their data with partners and competitors.",
    "contributors_beliefs_decentral": "we are convinced <em>decentralised data storage and peer-to-peer data flow</em> will make for faster, better, more resilient and ultimatively more sustainable and more democratic information infrastructure.",
    "contributors_beliefs_accessibiliy": "we <em>challenge current barriers</em> to entry and we do not accept that privacy-preserving computation should be difficult to develop, exclusive and expensive to own, or cumbersome to operate.",

    "contributors_mission": "our mission",
    "contributors_mission1": "we <em>empower everyone</em> to engage in privacy-preserving computation and help them implement their use cases.",
    "contributors_mission2": "we advocated <fdrtd>Federated Secure Computing</fdrtd>, a free and open standard and a <em>modern architecture</em> to render secure computing easy and convenient.",
    "contributors_mission3": "we provide <fdrtd>fdrtd</fdrtd>, our <em>free and open source</em> reference implementation as a starting point for feature-rich solutions.",
    "contributors_mission4": "we foster an <em>ecosystem and a community</em> for users and developers to share and learn.",
    "contributors_mission5": "we help you design <em>convincing show cases</em> and support you in building secure applications.",

    "contributors_todo": "work packages",
    "contributors_todo_clients": "clients in different languages",
    "contributors_todo_clients1": "we want everyone to be able to use our tech, and do not want to force developers to use a certain language or toolset. the more programming languages we can cover client-side, the better.",
    "contributors_todo_clients2": "we need people to translate our Python client (which is very small) into Java, Javascript, C++, Swift, Kotlin, and other programming languages.",
    "contributors_todo_clients3": "<em>difficulty:</em> intermediate",
    "contributors_todo_clients4": "<em>team size:</em> 1+",
    "contributors_todo_clients5": "<em>size of task:</em> small",
    "contributors_todo_clients6": "<em>skills needed:</em> Python + 1 other language",
    "contributors_todo_pysyft": "PySyft",
    "contributors_todo_pysyft1": "machine learning (ML) is one of the hottest topics for our target audience. many users want to leverage their distributed data to generate ML models.",
    "contributors_todo_pysyft2": "PySyft is one of the most promising frameworks for privacy-preserving machine learning. we need a team to implement a wrapper for the protocol as a collection of microservices.",
    "contributors_todo_pysyft3": "<em>difficulty:</em> advanced",
    "contributors_todo_pysyft4": "<em>team size:</em> 5+",
    "contributors_todo_pysyft5": "<em>size of task:</em> intermediate",
    "contributors_todo_pysyft6": "<em>skills needed:</em> Python, PySyft, server-side architecture and development",

    "contributors_resources": "resources",
    "contributors_resources_github": "GitHub repositories",
    "contributors_resources_github1": "find the public source code at <elink>https://github.com/fdrtd§github.com/fdrtd</elink>.",
    "contributors_resources_slack": "Slack",
    "contributors_resources_slack1": "join our Slack workspace at <elink>https://fdrtd.slack.com§fdrtd.slack.com</elink>.",
    "contributors_resources_literature": "literature",
    "contributors_resources_literature1": "Cramer R, Damgård IB, Nielsen JB: <em>Secure Multiparty Computation and Secret Sharing</em>. Cambridge 2015. <elink>https://doi.org/10.1017/CBO9781107337756§doi.org/10.1017/CBO9781107337756</elink>",

    "contributors_rules": "rules & style guide",
    "contributors_rules_license": "license",
    "contributors_rules_license1": "<fdrtd>fdrtd</fdrtd> is free and open source software.",
    "contributors_rules_license2": "this extends to the repositories located at <elink>https://github.com/fdrtd§https://github.com/fdrtd</elink>.",
    "contributors_rules_license3": "an appropriate <elink>https://opensource.org/licenses/MIT§MIT license</elink> is included in a <filename>LICENSE</filename> file in the root directory of all of these repositories.",
    "contributors_rules_contributions": "contributions policy",
    "contributors_rules_contributions1": "the project accepts contributions exclusively through <elink>https://github.com§GitHub</elink>. as per their terms of service,",
    "contributors_rules_contributions2": "<elink>https://docs.github.com/en/github/site-policy/github-terms-of-service#6-contributions-under-repository-license§GitHub   terms of service</elink>",
    "contributors_rules_contributions3": "'Whenever you add Content to a repository containing notice of a license, you license that Content under the same terms, and you agree that you have the right to license that Content under those terms.'",
    "contributors_rules_contributions4": "this widely-accepted norm in the open source community reflects what both contributors and users of an open source project will expect and assume. the advantage to you, the contributor, is that the project does not need to burden you with paperwork and separate contributor license agreements (CLAs) or even copyright transfer agreements (CTAs).",
    "contributors_rules_contributions5": "note that while you grant a license to use your contribution, you do not sign away copyright, but in fact retain full copyright for your own contribution. if you want to expressively assert your copyright by being listed in the project's <filename>CONTRIBUTORS</filename> files, please include an edit to this effect with your pull request.",
    "contributors_rules_styleguide": "style guide",
    "contributors_rules_styleguide_python": "<em>Python</em>",
    "contributors_rules_styleguide_python1": "follow <elink>https://google.github.io/styleguide/pyguide.html§Google's Python style guide</elink>.",

    "contributors_join": "join the team",
    "contributors_join_a": "call to action",
    "contributors_join_a1": "start coding today or give us a call.",
    "contributors_join_a2": "you may immediately access our repositories at <elink>https://github.com/fdrtd§https://github.com/fdrtd</elink> and start contributing. please read our <ilink>/contributors/rules§contribution policy</ilink>",
    "contributors_join_a3": "you may reach out at any time to <elink>mailto:support@fdrtd.com§support@fdrtd.com</elink>",
    "contributors_join_a4": "the common denominator in our team is English, but there is no such thing as a preffered language. we have people fluent in German, Hindi, and other languages. please ask for a contact person in your mother language.",
    "contributors_join_a5": "we are trying to be as inclusive as possible. if we fail to make our offering accessible to you, or to welcome your contribution, please let us know how to do better.",



    "technology_federated": "<fdrtd>Federated Secure Computing</fdrt>",

    "technology_design": "design highlights",
    "technology_design_a": "standardized API",
    "technology_design_a1": "<em>separation of concerns:</em> business logic and cryptography layer change for different reasons. the business logic is a high-level concern and changes only due to domain-specific and task-specific requirements. the cryptography layer is a low-level concern and changes only to improve privacy preservation on the network layer.",
    "technology_design_a2": "<em>dependency inversion:</em> the business logic depends only on the abstraction of the interface, and not its particular protocols or realizations. the cryptography layer depends only on the abstraction of the interface, and not the particular shape, size, or form of the business logic. neither depend on details of implementation.",
    "technology_design_a3": "<em>compatibility:</em> implementations are easy to port to different operating systems and legacy environments.",
    "technology_design_a4": "<em>interoperability:</em> users do not need to run the same software or systems and still are able to directly collaborate.",
    "technology_design_b": "microservices",
    "technology_design_b1": "<em>single responsibility:</em> every microservice is responsible for one particular privacy-preserving computation (e.g. secure sum, private set intersection). sacrificing monolithic universality allows every single one of them to be highly optimized to their task.",
    "technology_design_b2": "<em>open-closed principle:</em> extending the functionality is as simple as adding yet another microservice to the bus. on the other hand, no microservice has to ever be modified for changes in another. the services may continue to run as is across versions, servers, operating systems.",
    "technology_design_c": "client-server architecture",
    "technology_design_c1": "<em>performance:</em> the complete computing overhead is offloaded to the server where it can be handled much more efficiently.",
    "technology_design_c2": "<em>ready for cloud:</em> simply run the server in an instance in the cloud. there are also particular microservices for e.g. databases provided by the major IaaS platforms.",
    "technology_design_c3": "<em>ready for IoT:</em> the remaining clients are so small (kilobytes) that they run on any smartwatch or IoT device.",
    "technology_design_d": "security by design",
    "technology_design_d1": "<em>keep data away from people:</em> one may keep the entire data flow server-side resp. in the cloud.",
    "technology_design_d2": "<em>one-way flow of data:</em> there are no endpoints to download raw data to the client, only results.",
    "technology_design_d3": "<em>ingress free:</em> through simple daemons outside of the firewall, peer-to-peer servers may operate egress-only.",
    "technology_design_e": "open technology",
    "technology_design_e1": "<em>convenient devsecops:</em> fdrtd is not another framework but rather an API standard defining the architecture of a middleware designed to make privacy-preserving computing simple to develop, convenient to operate and straightforward to secure.",
    "technology_design_e2": "<em>freedom of choice:</em> users of fdrtd do not have to choose a particular protocol (e.g. secure multiparty computation, homomorphic encryption) or particular implementation, but may switch them on the fly without any changes to the business logic.",
    "technology_design_e3": "<em>3rd party ecosystem:</em> server-side cryptography developers may write wrappers for their frameworks to make them available to the audience of <fdrtd>fdrtd</fdrtd>.",
    "technology_design_f": "ready for business",
    "technology_design_f1": "<em>industry-grade:</em> we aim for industry-grade best practices in code design and deployment.",
    "technology_design_f2": "<em>turn-key:</em> we aim to provide a turn-key solution that gets you up to speed within a single scrum sprint.",
    "technology_design_f3": "<em>functionality:</em> we aim to provide wrappers for languages and databases as needed by the majority of users.",
    "technology_design_g": "free and open source",
    "technology_design_g1": "<em>transparency:</em> users of <fdrtd>fdrtd</fdrtd> can have absolute peace of mind that their sensitive data is processed in the exact way it should be.",
    "technology_design_g2": "<em>no barriers to entry:</em> we want every company, institution, and individual to be able to reap the benefits of privacy-preserving computation.",

    "technology_clientserver": "client & server architecture",
    "technology_clientserver_a": "layers of the client & server stack",

    "technology_microservices": "fast and lean microservices",

    "technology_platform": "platform & ecosystem",

    "technology_cloud": "ready for cloud & IoT",



    "solution_fdrtd": "<fdrtd>fdrtd & fdrtd server</fdrtd>",

    "solution_protocols": "supported protocols",

    "solution_usecases": "supported use cases",

    "solution_features": "built-in features",

    "solution_plugandplay": "plug & play extensibility",

    "solution_foss": "free & open source",

    

    "news": "news",
    "news_2021-05-31": "continued support by Stifterverband",
    "news_2021-05-31_a": "during the past six month our team has received both financial support and invaluable counseling and mentorship by Stifterverband (the German Donors' Association) and its partners. their goal is to foster and promote ideas and initiatives which are expected to create substantial and lasting social benefit and to improve the German education and innovation system.",
    "news_2021-05-31_b": "we are immensely grateful to learn that the board has selected our project as one of the top 30 for the second phase of the program. during the next months we will concentrate on scalability, transferability, and sustainability of our proposition.",
    "news_2021-05-31_c": "if you want to help us create a convincing showcase, or if you are willing to contribute to the project, please contact the team. everyone is welcome.",
    "news_2021-04-03": "fdrtd is free and open source",
    "news_2021-04-03_a": "today, <fdrtd>fdrtd</fdrtd> has become free and open source. the first repositories have been published on GitHub under the MIT license.",
    "news_2021-04-03_b": "during the 'Wirkung hoch 100' mentorship, it has become clear that we may measure our success only by the systemic impact our solution creates. as a freely expandable open technology platform defined by an OpenAPI 3.0 standard, our solution is technically already very open. it naturally lends itself to become free and open source software.",
    "news_2021-04-03_c": "we believe the only way ahead in software development today is through co-creation. we invite everyone to take part in our adventure and become part of the team. together we can create not only a product, but rather a movement that changes how institutions, corporations, and individuals will deal in privacy and digital collaboration.",
    "news_2021-03-12": "successful live demonstration",
    "news_2021-03-12_a": "today, <fdrtd>fdrtd</fdrtd> was demonstrated in front of a live audience of about 70 experts from the German healtcare informatics initiative.",
    "news_2021-03-12_b": "between two university hospitals in Munich and Dresden, a simple distributed calculation was performed ad hoc. the exercise was part of a hackathon and learning experience to build capabilities at the partner sites across Germany.",
    "news_2021-03-12_c": "UPDATE June 2021: in the meantime, different alpha versions have been successfully tested by six or more university hospitals.",
    "news_2021-03-11": "public test servers are live",
    "news_2021-03-11_a": "for the convenience of users who want to test <fdrtd>fdrtd</fdrtd>, there are public test servers available now. without the need to set up and run their own servers, scientists and developers may test our technology in minutes.",
    "news_2021-03-11_b": "the test servers will be regularly updated with the latest development build. they are completely open without authentication, so for security and privacy reasons, some functionality has been removed, and no personal data may be uploaded.",
    "news_2021-03-11_c": "our first batch of five public test servers is kindly provided to the scientific community by Leibniz Rechenzentrum (LRZ), one of the leading supercomputing facilities in Europe. additional servers for commercial enterprises will be provided on the infrastructure of Amazon Web Services.",
    "news_2020-12-02": "bytes for life founded",
    "news_2020-12-02_a": "bytes for life GmbH is a spin-off of LMU Munich. it provides consulting in the area of technology transfer as well as software development with a focus on SaaS and cloud computing.",
    "news_2020-12-02_b": "the start-up will sponsor <fdrtd>fdrtd</fdrtd> and provide the necessary legal, financial, and operational framework such as team building, website hosting, human support, community events, and general oversight.",
    "news_2020-11-09": "Stifterverband supports Federated Secure Computing",
    "news_2020-11-09_a": "'Wirkung hoch 100' is a program by Stifterverband, the German Donor's Association. in its 100th year of operation, they decided to identify and support 100 ideas that have the potential to benefit the German education and innovation ecosystem.",
    "news_2020-11-09_b": "out of over 500 applications, <fdrtd>Federated Secure Computing</fdrtd> was selected to be one of the promoted projects. during the coming months we will receive funding and mentorship and will co-create with other teams what we believe is intelligent data protection made in Germany.",
    "news_2020-11-09_c": "our job is to make privacy preserving computation available to all by reducing barriers and creating awareness. we are thrilled to meet the other teams and even more motivated to push our development ahead.",
    "news_2020-03-02": "mobile and cloud boost secure distributed computing",
    "news_2020-03-02_a": "an early prototype of our technology demonstrates the benefits of a lean client-server architecture in the context of secure distributed computing.",
    "news_2020-03-02_b": "as a benchmark, we looked at a traditional secure multiparty computation solution we had devised earlier. the setup included two Intel Xeon servers, each 8 cores, 2.6 GHz, 128 GB RAM, and 1 Gb/s networking via fast internet backbone between university hospitals in Munich and Berlin. its devops required two systems administrators and one expert programmer for several weeks.",
    "news_2020-03-02_c": "by comparison, our early prototype ran on a Samsung Galaxy XCover 4, took 15 minutes to develop for a total of 9 lines of Python code, and executed a homomorphic encryption protocol via the public 4G mobile cell phone network, leveraging the server-side computing power of AWS Frankfurt.",
    "news_2020-03-02_d": "the result was exact to machine precision and took 4.5 seconds to compute, compared to 1,229 seconds of the original solution (speedup 10^2 ... 10^3).",
    
    "about": "about us",
    "about_project": "the open source project",
    "about_project1": "we are a group of volunteers working on an open source project to simplify the use of privacy-preserving computation.",
    "about_begin": "how it all started",
    "about_begin1": "in 2019, our team demonstrated the very first application of secure multiparty computation on real life patient data, between Glioblastoma survivors at Charité, Berlin, and LMU Hospital, Munich.",
    "about_begin2": "the classical setup used two dedicated servers, entertained two system operators, and cost an expert programmer several weeks to design and develop. calculation was eventually successful over the fast internet backbone and took about 20 minutes.",
    "about_begin3": "↗ <elink>https://www.aerzteblatt.de/nachrichten/103090/Innovatives-IT-Verfahren-soll-sensible-Daten-in-der-Krebsforschung-schuetzen§Ärzteblatt: Innovatives IT-Verfahren soll sensible Daten in der Krebsforschung schützen</elink>",
    "about_community": "our community",
    "about_community1": "we are part of the Munich and German start-up ecosystems. we are grateful for the coaching and counseling we receive, and we are thrilled to pursue new avenues with our friends near and far.",
    "about_community2": "our roots are in healthcare, in particular clinical research at university hospitals, but we embrace use cases from other industries and functions.",

    "acknowledgements": "acknowledgements",
    "acknowledgements_sponsors": "sponsors and supporters",
    "acknowledgements_sponsors_": "the <fdrtd>fdrtd</fdrtd> project would like to express its heartfelt thanks to its sponsors and supporters:",
    "acknowledgements_stifterverband": "<elink>https://www.stifterverband.org§Stifterverband</elink> (German donors' association) financially supports the project and provides invaluable counseling and mentoring through its <elink>https://www.stifterverband.org/wirkunghoch100§Wirkung hoch 100</elink> initiative. during this program, federated secure computing was selected as one of the top 30 ideas for the future of the German education, science and innovation ecosystem.",
    "acknowledgements_bytesforlife": "<elink>https://www.bytesforlife.com§bytes for life GmbH</elink> is a spin-off of LMU Munich. it provides consulting in the area of technology transfer as well as software development with a focus on SaaS and cloud computing. the start-up sponsors <fdrtd>fdrtd</fdrtd> and provides the necessary legal, financial, and operational framework such as team building, website hosting, human support, community events, and general oversight.",
    "acknowledgements_lrz": "<elink>https://www.lrz.de§Leibniz-Rechenzentrum</elink> of the Bavarian Academy of Sciences is one of the European super computing facilities. among other services, they provide a very flexible and convenient cloud infrastructure. through the project's affiliation with LMU Munich their <elink>https://doku.lrz.de/display/PUBLIC/Compute+Cloud§LRZ Compute Cloud</elink> hosts our test servers for the scientific community.",
    "acknowledgements_tools": "3rd party software",
    "acknowledgements_tools_": "the <fdrtd>fdrtd</fdrtd> project could be built thanks to a stack of amazing tech:",
    "acknowledgements_gatsby": "<elink>https://www.gatsbyjs.com§Gatsby</elink>, a dynamic site generator, was used to build this website",
    "acknowledgements_github": "<elink>https://www.github.com§GitHub</elink> provides free open source repositories and great collaboration tools",
    "acknowledgements_jetbrains": "<elink>https://www.jetbrains.com§JetBrains</elink> provides free community edition IDEs for multiple programming languages",
    "acknowledgements_openapi": "<elink>https://www.openapis.org§OpenAPI</elink> specification and Swagger UI tools",
    "acknowledgements_vscode": "<elink>https://code.visualstudio.com§Visual Studio Code</elink> was used for website design and editing",

    "media": "press & media",
    "media_downloads": "downloads",
    "media_logo_dark": "logo for dark backgrounds (<dlink>/home/media/logo_dark.png§download</ilink>, 406 x 406 pixels, 14 KB)",
    "media_logo_light": "logo for light backgrounds (<dlink>/home/media/logo_light.png§download</ilink>, 406 x 406 pixels, 12 KB)",

    "contact": "contact",
    "contact_support": "support",
    "contact_support1": "if you need help using our software, if you want advise on building your showcase, or if you want to give feedback, please write an email to:",
    "contact_other": "other inquiries",
    "contact_other1": "<em>project lead:</em> Hendrik Ballhausen, <elink>mailto:ballhausen@bytesforlife.com§ballhausen@bytesforlife.com</elink>",
    "contact_other2": "<em>community manager:</em> Elisabeth Bießlich-Keller, <elink>mailto:e.keller@med.uni-muenchen.de§e.keller@med.uni-muenchen.de</elink>",
    "contact_vulnerabilities": "vulnerabilities",
    "contact_vulnerabilities1": "if you found a vulnerability in our open source code, please open an issue on <elink>https://github.com/fdrtd§GitHub</elink> and mark it as critical / vulnerability.",
    
    "faq": "FAQ",
    "faq_crypto": "crypto",
    "faq_smpc": "is <fdrtd>fdrtd</fdrtd> another secure multiparty computation framework?",
    "faq_smpc_": "<fdrtd>fdrtd</fdrtd> is a middleware that runs privacy-preserving computation protocols server-side. it may run some secure multiparty computation framework, but not necessarily so. homomorphic encryption or proprietary protocols such as DataSHIELD are alternatives. in any case, a protocol plugin is needed in addition to the core server routines.",
    "faq_blockchain": "is <fdrtd>fdrtd</fdrtd> based on the blockchain?",
    "faq_blockchain_": "blockchains and peer-to-peer protocols are building blocks of distributed ledgers and decentralized applications. privacy-preserving computation is similar in that it often uses secure peer-to-peer networks without a central instance. however, while the blockchain is about transparency, traceability, non-falseability, and immutability; privacy-preserving computation is about secrecy, privacy, and anonymity. there may be some particular protocols employing blockchains for various purposes, but in general, <fdrtd>fdrtd</fdrtd> is not based on the blockchain.",
    "faq_coins": "do you generate coins or NFTs? do you plan an ICO?",
    "faq_coins_": "no! this is NOT a cryptocurrency project. also, our tech is open source and free for all.",



    "legal_privacy_heading": "privacy policy",
    "legal_privacy_a": "personal data",
    "legal_privacy_a1": "Personal data (usually referred to just as “data” below) will only be processed by us to the extent necessary and for the purpose of providing a functional and user-friendly website, including its contents, and the services offered there.",
    "legal_privacy_a2": "Per Art. 4 No. 1 of Regulation (EU) 2016/679, i.e. the General Data Protection Regulation (hereinafter referred to as the “GDPR”), “processing” refers to any operation or set of operations such as collection, recording, organization, structuring, storage, adaptation, alteration, retrieval, consultation, use, disclosure by transmission, dissemination, or otherwise making available, alignment, or combination, restriction, erasure, or destruction performed on personal data, whether by automated means or not.",
    "legal_privacy_a3": "The following privacy policy is intended to inform you in particular about the type, scope, purpose, duration, and legal basis for the processing of such data either under our own control or in conjunction with others. We also inform you below about the third-party components we use to optimize our website and improve the user experience which may result in said third parties also processing data they collect and control.",
    "legal_privacy_a4": "Our privacy policy is structured as follows:",
    "legal_privacy_b": "I. Information about us as controllers of your data",
    "legal_privacy_b1": "the party responsible for this website (the “controller”) for purposes of data protection law is:",
    "legal_privacy_b2": "bytes for life GmbH",
    "legal_privacy_b3": "Kaulbachstrasse 61a",
    "legal_privacy_b4": "80539 Munich",
    "legal_privacy_b5": "Germany",
    "legal_privacy_b6": "telephone: +49 – 176 – 38 23 92 81",
    "legal_privacy_b7": "email: <elink>mailto:mail@bytesforlife.com§mail@bytesforlife.com</elink>",
    "legal_privacy_b8": "website: <elink>https://www.bytesforlife.com§www.bytesforlife.com</elink>",
    "legal_privacy_c": "II. The rights of users and data subjects",
    "legal_privacy_c1": "With regard to the data processing to be described in more detail below, users and data subjects have the right",
    "legal_privacy_c2": "to confirmation of whether data concerning them is being processed, information about the data being processed, further information about the nature of the data processing, and copies of the data (cf. also Art. 15 GDPR);",
    "legal_privacy_c3": "to correct or complete incorrect or incomplete data (cf. also Art. 16 GDPR);",
    "legal_privacy_c4": "to the immediate deletion of data concerning them (cf. also Art. 17 DSGVO), or, alternatively, if further processing is necessary as stipulated in Art. 17 Para. 3 GDPR, to restrict said processing per Art. 18 GDPR;",
    "legal_privacy_c5": "to receive copies of the data concerning them and/or provided by them and to have the same transmitted to other providers/controllers (cf. also Art. 20 GDPR);",
    "legal_privacy_c6": "to file complaints with the supervisory authority if they believe that data concerning them is being processed by the controller in breach of data protection provisions (see also Art. 77 GDPR).",
    "legal_privacy_c7": "In addition, the controller is obliged to inform all recipients to whom it discloses data of any such corrections, deletions, or restrictions placed on processing the same per Art. 16, 17 Para. 1, 18 GDPR. However, this obligation does not apply if such notification is impossible or involves a disproportionate effort. Nevertheless, users have a right to information about these recipients.",
    "legal_privacy_c8": "Likewise, under Art. 21 GDPR, users and data subjects have the right to object to the controller’s future processing of their data pursuant to Art. 6 Para. 1 lit. f) GDPR. In particular, an objection to data processing for the purpose of direct advertising is permissible.",
    "legal_privacy_d": "III. Information about the data processing",
    "legal_privacy_d1": "Your data processed when using our website will be deleted or blocked as soon as the purpose for its storage ceases to apply, provided the deletion of the same is not in breach of any statutory storage obligations or unless otherwise stipulated below.",
    "legal_privacy_d2": "Server data",
    "legal_privacy_d3": "For technical reasons, the following data sent by your internet browser to us or to our server provider will be collected, especially to ensure a secure and stable website: These server log files record the type and version of your browser, operating system, the website from which you came (referrer URL), the webpages on our site visited, the date and time of your visit, as well as the IP address from which you visited our site.",
    "legal_privacy_d4": "The data thus collected will be temporarily stored, but not in association with any other of your data.",
    "legal_privacy_d5": "The basis for this storage is Art. 6 Para. 1 lit. f) GDPR. Our legitimate interest lies in the improvement, stability, functionality, and security of our website.",
    "legal_privacy_d6": "The data will be deleted within no more than seven days, unless continued storage is required for evidentiary purposes. In which case, all or part of the data will be excluded from deletion until the investigation of the relevant incident is finally resolved.",
    "legal_privacy_d7": "Cookies",
    "legal_privacy_d8": "This website does not use cookies.",
    "legal_privacy_d9": "Contact",
    "legal_privacy_d10": "If you contact us via email or the contact form, the data you provide will be used for the purpose of processing your request. We must have this data in order to process and answer your inquiry; otherwise we will not be able to answer it in full or at all.",
    "legal_privacy_d11": "The legal basis for this data processing is Art. 6 Para. 1 lit. b) GDPR.",
    "legal_privacy_d12": "Your data will be deleted once we have fully answered your inquiry and there is no further legal obligation to store your data, such as if an order or contract resulted therefrom.",
    "legal_privacy_footer": "this privacy policy was derived from the <elink>https://www.ratgeberrecht.eu/leistungen/muster-datenschutzerklaerung.html§Model Data Protection Statement</elink> by <elink>https://www.ratgeberrecht.eu§Anwaltskanzlei Weiß & Partner</elink>.",

    "legal_contact_heading": "contact",
    "legal_contact_a": "information as per German Telemedia Act section 5",
    "legal_contact_a1": "bytes for life GmbH",
    "legal_contact_a2": "Kaulbachstrasse 61a",
    "legal_contact_a3": "80539 Munich",
    "legal_contact_a4": "Germany",
    "legal_contact_a5": "phone: +49 – 176 – 38 23 92 81",
    "legal_contact_a6": "email: <elink>mailto:mail@bytesforlife.com§mail@bytesforlife.com</elink>",
    "legal_contact_a7": "website: <elink>https://www.bytesforlife.com§www.bytesforlife.com</elink>",
    "legal_contact_a8": "registry court, registry number",
    "legal_contact_a9": "District Court Munich, HRB 262175",
    "legal_contact_a10": "managing director",
    "legal_contact_a11": "Dr. Hendrik Ballhausen",
    "legal_contact_a12": "sales tax ID",
    "legal_contact_a13": "DE 338 44 66 35",



 


    "pitch_d1a": "in 2019, our team demonstrated the very first application of secure multiparty computation on real life patient data, between Glioblastoma survivors at Charité, Berlin, and LMU Hospital, Munich. → <ilink>/usecases/healthcare§use cases: healthcare</ilink>",
    "pitch_d1b": "the classical setup used two dedicated servers, entertained two system operators, and cost an expert programmer several weeks to design and develop. calculation was eventually successful over the fast internet backbone and took about 20 minutes.",
    "pitch_d1c": "↗ <elink>https://www.aerzteblatt.de/nachrichten/103090/Innovatives-IT-Verfahren-soll-sensible-Daten-in-der-Krebsforschung-schuetzen§Ärzteblatt: Innovatives IT-Verfahren soll sensible Daten in der Krebsforschung schützen</elink>",
    "pitch_d2": "<em>after</em>",
    "pitch_d2a": "in 2020, a very early prototype was deployed to Amazon Web Services in Frankfurt, leveraging their server-side computation power, and the small client library was installed on a Samsung Galaxy XCover smartphone. → <ilink>/technology/cloud§ready for IoT and cloud</ilink>",
    "pitch_d2b": "it took a non-expert programmer about 15 minutes to write 9 lines of Python code to achieve the very same calculation as before. → <ilink>/solution/features§features and perks</ilink>",
    "pitch_d2c": "a homomorphic encryption protocol was employed, distributed over the public 4G cell phone network, and executed in 4.5 seconds. → <ilink>/solution/protocols§supported protocols</ilink>",
    "pitch_d3": "<em>today</em> it only takes a single command <code>pip install fdrtd</code> to make our solution available: instantly, anywhere, on any device, for free.",

    "pitch_bh": "2. value proposition",
    "pitch_b": "the missing link between cryptography and business logic",
    "pitch_b1": "talking to potential users, learning from their experience, and listening to their concerns, it became evident that another difficult crypto framework is not what was needed most. instead of reinventing the wheel, what was really missing was some middleware that would make existing crypto frameworks simple to use and convenient to operate.",
    "pitch_b5": "→ <ilink>/motivation/requirements§user requirements</ilink>",
    "pitch_b2": "<em>getting rid of the pain points</em>",
    "pitch_b3": "our approach is different and entirely focused on a good devsecops experience",
    "pitch_b4a": "we do not require your programmers to be experts at cryptography or have any particular skills beyond basic",
    "pitch_b4b": "we do not require your developers to use any particular language, framework or toolset – just use your favourite",
    "pitch_b4c": "we do not require your operations to run any particular operating system, hardware, virtual machine or device",
    "pitch_b4d": "we do not require you to redesign your legacy codebase",
    "pitch_b4e": "instead, we allow you to introduce secure computing step by step, microservice by microservice",
    "pitch_b4f": "to easily do so, we provide you with an API that you can call from anywhere and a backend that runs anywhere",
    "pitch_b8": "→ <ilink>/motivation/designgoals§design goals</ilink>",

    "pitch_ch": "3. underlying magic",
    "pitch_c": "a federated microservices architecture for server, cloud, and IoT",
    "pitch_c1": "<fdrtd>Federated Secure Computing</fdrtd> highlights its core principles:",
    "pitch_c2a": "<em>federated</em>: capture the full value of your data; cooperate with partners and customers; interconnect heterogenous systems.",
    "pitch_c2b": "<em>secure</em>: do so without sharing data; retain control and custody over your data; reveal and share only the collaborative result",
    "pitch_c2c": "<em>computing</em>: design solutions in a modern architecture; develop and operate them the easiest way; leverage your codebase and skills",
    "pitch_c3": "</em>our innovative architecture <fdrtd>Federated Secure Computing</fdrtd> lets you easily design distributed application client-side, while offloading all of the difficult and computing intensive cryptography server-side. it is based on fast and lean microservices and is described by a Open API 3.0 standard. as a plug &amp; play open technology platform, it orchestrates various protocols with or without a central 3rd party (e.g. homomorphic encryption or secure multiparty computation).",

    "pitch_eh": "5. business model",
    "pitch_e": "free and open source software, and a community to build it",
    "pitch_e1": "tbd. → <ilink>/motivation/data§the value of data</ilink>",
    "pitch_e2": "tbd. → <ilink>/motivation/privacy§the value of privacy</ilink>",
    "pitch_e3": "tbd. → <ilink>/motivation/cryptography§cryptography</ilink>",
    "pitch_e4": "tbd. → <ilink>/motivation/challenges§challenges</ilink>",
    "pitch_fh": "6. go-to-market strategy",
    "pitch_f": "from healthcare, going wide across industries",
    "pitch_f1": "tbd. → <ilink>/motivation/data§the value of data</ilink>",
    "pitch_f2": "tbd. → <ilink>/motivation/privacy§the value of privacy</ilink>",
    "pitch_f3": "tbd. → <ilink>/motivation/cryptography§cryptography</ilink>",
    "pitch_f4": "tbd. → <ilink>/motivation/challenges§challenges</ilink>",

    "pitch_gh": "7. competitive analysis",
    "pitch_g": "back-end choices for our users",
    "pitch_g1": "<em>alternatives</em>",
    "pitch_g1a": "mutual data sharing: <green>cheap</green> - <green>simple</green> - <red>no privacy</red> - <red>no control</red> - <red>moral hazard</red>",
    "pitch_g1b": "trusted 3rd parties: <green>efficient</green> - <green>convenient</green> - <red>costly</red> - <red>requires trust</red> - <red>attack surface</red>",
    "pitch_g1c": "siloed data (the sad reality): <red>69% of European companies do not share data at all</red>",
    "pitch_g2": "<em>competitors</em>",
    "pitch_g2i": "(read: potential allies and providers to our ecosystem)",
    "pitch_g2a": "monolithic open source frameworks: <green>done by academic experts</green> - <red>difficult devsecops</red>",
    "pitch_g2b": "(we are really happy about these as these give our users choice as back-ends on our solution)",
    "pitch_g2c": "a few first commercial solutions: <green>well managed</green> - <red>costly</red> - <red>very specific</red>",
    "pitch_g3": "<em>landscape</em>",
    "pitch_g3a": "<10 free and open source frameworks (of the classic, academic, monolithic variant)",
    "pitch_g3b": "43 players worldwide, almost all start-ups → <elink>www.mpcalliance.org§MPC alliance</elink>",
    "pitch_g3c": "research and engineering teams at Microsoft, Google, Amazon Web Services, and other tech giants have been testing the waters for some time",

    "pitch_hh": "8. management team",
    "pitch_h": "we are hiring",
    "pitch_h1": "core team",
    "pitch_h1a": "<em>Hendrik Ballhausen</em>, tech lead",
    "pitch_h1b": "<em>Elisabeth Bießlich-Keller</em>, community manager",
    "pitch_h1c": "<em>Uday Nakade</em>, junior developer",
    "pitch_h2": "advisors",
    "pitch_h2a": "tba",
    "pitch_h3": "contributors",
    "pitch_h3a": "tba",

    "pitch_ih": "9. metrics and projections",
    "pitch_i": "achievements to date",
    "pitch_i1": "tbd. → <ilink>/motivation/data§the value of data</ilink>",
    "pitch_i2": "tbd. → <ilink>/motivation/privacy§the value of privacy</ilink>",
    "pitch_i3": "tbd. → <ilink>/motivation/cryptography§cryptography</ilink>",
    "pitch_i4": "tbd. → <ilink>/motivation/challenges§challenges</ilink>",

    "pitch_jh": "10. milestones and next steps",
    "pitch_j": "help us deliver on our promise",
    "pitch_j1": "tbd. → <ilink>/motivation/data§the value of data</ilink>",
    "pitch_j2": "tbd. → <ilink>/motivation/privacy§the value of privacy</ilink>",
    "pitch_j3": "tbd. → <ilink>/motivation/cryptography§cryptography</ilink>",
    "pitch_j4": "tbd. → <ilink>/motivation/challenges§challenges</ilink>",

    "pitch_kh": "call to action",
    "pitch_k": "your next steps",
    "pitch_k1": "tbd. → <ilink>/motivation/data§the value of data</ilink>",
    "pitch_k2": "tbd. → <ilink>/motivation/privacy§the value of privacy</ilink>",
    "pitch_k3": "tbd. → <ilink>/motivation/cryptography§cryptography</ilink>",
    "pitch_k4": "tbd. → <ilink>/motivation/challenges§challenges</ilink>",

    "onboarding": "how to contribute",
    "onboarding_c": "your role",
    "onboarding_c1": "<em>adviser:</em> have a say in the definition of a free and open standard for <fdrtd>Federated Secure Computing</fdrtd> and leverage your technological or business experience to make our story a success.",
    "onboarding_c2": "<em>developer:</em> help us build <fdrtd>fdrtd</fdrtd>, our open source reference implementation. we welcome any programming language as we are broadening our client base. we are looking for people with experience or interest in team driven development, distributed application, applied cryptography and devsecops, and scientific computing.",
    "onboarding_c3": "<em>early adopter:</em> let us design a solution for your distributed computing problem and let us create a convincing showcase together. we are looking for challenges from any industry or function.",
    "onboarding_c4": "<em>policy maker:</em> become knowledgeable about the promise of ditributed computing. help your community or society retain control, and agency over their data, while at the same time reaping the benefits of collaboration and sharing.",
    "onboarding_c5": "<em>vendor:</em> populate our ecosystem and supply your solutions to our future client base. make your frameworks and protocols accessible through standardized syntax and concise workflows.",
    "onboarding_c6": "<em>communicator:</em> evangelize about a new intelligent way to protect personal and business data. help people realize the full value of their data and offer them a way to achieve their goals.",
    "onboarding_c7": "<em>educator:</em> train your students cryptography and distributed computing in a simple and accessible way. we are educators ourselves and have real hands-on projects for classes of any size and difficulty level.",
    "onboarding_c8": "<em>media partner:</em> journalists and other media outlets are very welcome to assess our project and technology. please talk to us at any time.",

    "data_a1": "97% of companies believe analytics will improve their competitive position. 75% of companies would be willing to share their data."
}