{
    "title": "fdrtd - federated secure computing",
    
    "404_not_found": "404 page not found",
    "soon_tm": "(this is a placeholder page. content is to follow in the coming days.)",
    "toc": "table of contents",

    "general_source": "source",
    "general_imagecredit": "image credit",

    "previous_topic": "previous topic",
    "next_topic": "next topic",

    "nav_users": "for users",
    "nav_users_benefit": "key benefits",
    "nav_users_usecases": "use cases",
    "nav_users_journey": "user journey",
    "nav_users_solution": "solution",
    "nav_users_start": "how to start",
    
    "nav_developers": "for developers",
    "nav_developers_architecture": "design & architecture",
    "nav_developers_middleware": "middleware & solution",
    "nav_developers_features": "features & extensions",
    "nav_developers_resources": "resources & support",
    "nav_developers_contribute": "how to contribute",
    
    "nav_supporters": "for supporters",
    "nav_supporters_news": "news",
    "nav_supporters_pitch": "pitch",
    "nav_supporters_acknowledgements": "acknowledgements",
    "nav_supporters_media": "press & media",
    "nav_supporters_contact": "contact",

    "nav_docs": "<fdrtd>documentation</fdrtd>",

    "nav_github": "<fdrtd>source code</fdrtd>",

    "nav_language_select": "language",
    "nav_language_en": "English",
    "nav_language_de": "German",
    "nav_language_hi": "Hindi",

    "nav_theme": "theme",
    "nav_theme_dark": "dark mode",
    "nav_theme_light": "day mode",
    "nav_theme_highcontrast": "high contrast",

    "nav_legal": "legal",
    "nav_legal_privacy": "privacy",
    "nav_legal_contact": "contact",





    "welcome": "welcome",

    "welcome_nutshell": "in a nutshell",
    "welcome_nutshell_1": "<em><fdrtd>Federated Secure Computing</fdrtd></em> is an easy and conventient way to design, develop, and deploy secure distributed applications.",
    "welcome_nutshell_2": "the modern architecture is based on fast microservices and provides strong cryptopgraphy protocols both on-premises or in the cloud.",
    "welcome_nutshell_3": "<em><fdrtd>fdrtd</fdrtd></em> is a minimalistic reference implementation for commercial, scientific, and educational use.",
    "welcome_nutshell_4": "the free and open source software comes with a number of built-in features and can be tailored by plug&play extensions to your use case.",

    "welcome_users": "for users",
    "welcome_users_0": "(e.g. managers, scientists)",
    "welcome_users_1": "does your company or organization possess <em>private, proprietary, or confidential data</em> you can not, do not want to, or must not share with others?",
    "welcome_users_2": "do you realize this data <em>would become much more meaningful and valuable</em> if you could make it available for joint analytics with partners or even competitors?",
    "welcome_users_3": "<em>with modern cryptography</em>, secure distributed applications are a reality. several interested parties may cooperate and achieve joint results <em>without data sharing</em>, keeping their data in their custody at all times.",
    "welcome_users_4a": "discover <ilink>/users/usecases§use cases</ilink> from healthcare to autonomous driving.",
    "welcome_users_4b": "chart your <ilink>/users/journey§user journey</ilink> to secure distributed computing.",
    "welcome_users_4c": "learn how our <ilink>/users/solution§solution</ilink> reduces barriers to entry.",
    "welcome_users_4d": "evaluate <ilink>/users/benefit§key benefits</ilink> along your roadmap.",
    "welcome_users_4e": "approach us to help you <ilink>/users/start§get started</ilink>.",

    "welcome_developers": "for developers",
    "welcome_developers_0": "(e.g. architects, open source contributors)",
    "welcome_developers_1": "are you a developer tasked to implement privacy-preserving computation? are you looking for the fastest and most convenient way to build a prototype?",
    "welcome_developers_2": "are you a teacher, student, or scientist looking for an easy approach to a modern key technology? do you want to build a demo or create a framework for your school or university?",
    "welcome_developers_3": "are you an expert in secure multiparty computation, homomorphic encryption or the like? would you like to share best practices and contribute to a free and open source project?",
    "welcome_developers_4a": "derive your <ilink>/developers/architecture§architecture</ilink> from <em><fdrtd>Federated Secure Computing</fdrtd></em> to meet your design goals.",
    "welcome_developers_4b": "deploy <em><fdrtd>fdrtd</fdrtd></em> as a <ilink>/developers/middleware§middleware</ilink> to make devsecops simple and convenient.",
    "welcome_developers_4c": "discover <ilink>/developers/features§features and extensions</ilink> from a range of cryptographic protocols.",
    "welcome_developers_4d": "there are <ilink>/developers/resources§resources and support</ilink> to help you get started.",
    "welcome_developers_4e": "you are welcome to <ilink>/developers/contribute§contribute</ilink> to our open source project.",

    "welcome_supporters": "for supporters",
    "welcome_supporters_0": "(e.g. policy makers, foundations)",
    "welcome_supporters_1": "do you want to help society, science, and economy to realize the full potential of valuable data? do you want to accelerate the digital transition and the creation of data markets?",
    "welcome_supporters_2": "but are you concerned about privacy, consent, and agency at the same time? do you want to improve data protection standards and make data infrastructure more decentral and democratic?",
    "welcome_supporters_3": "do you want to lower barriers to entry for smaller parties and help build an ecosystem for individuals, private organizations, small businesses and institutions of the public sector alike?",
    "welcome_supporters_4a": "follow the <ilink>/supporters/news§news</ilink> about our project.",
    "welcome_supporters_4b": "read our <ilink>/supporters/pitch§pitch</ilink> to empower everyone to use privacy-preserving computation.",
    "welcome_supporters_4c": "get to know other supporters in the <ilink>/supporters/acknowledgements§acknowledgements</ilink>.",
    "welcome_supporters_4d": "find press clippings and articles in the <ilink>/supporters/media§media</ilink> section.",
    "welcome_supporters_4e": "reach out and <ilink>/supporters/contact§contact</ilink> the team.",





    "usecases": "use cases",
    "usescases_clinicalstudy": "clinical research",
    "usescases_clinicalstudy_1": "two or more university hospitals collect data on patients with a particular disease.",
    "usescases_clinicalstudy_2": "due to privacy regulation, the hospitals are not allowed to exchange any of their data.",
    "usescases_clinicalstudy_3": "with differential privacy (DP), hospitals may run joint evaluation on their aggregate data without sharing any of it.",
    "usescases_adriving": "autonomous driving",
    "usescases_adriving_1": "analytics of peoples driving patterns can help manufacturers optimize their cars, and can help prevent traffic jams.",
    "usescases_adriving_2": "for privacy reasons, individual drivers would rather not share their travel history.",
    "usescases_adriving_3": "with privacy-preserving computation (PPC), cars can securely communicate peer-to-peer, and manufacturers can monitor fleet behaviour.",
    "usescases_contacttracing": "contact tracing",
    "usescases_contacttracing_1": "mobile apps can trace contacts and prevent the spread of COVID-19.",
    "usescases_contacttracing_2": "for privacy reasons, individuals would not want their contacts stored in a central database.",
    "usescases_contacttracing_3": "with decentralized privacy-preserving proximity tracing (DP3T), contracts can be traced in an anonymous fashion and exposed contacts still be notified.",
    "usescases_spysatellites": "sattelite orbits",
    "usescases_spysatellites_1": "spy satellites are fragile tin cans with a $300m price tag orbiting earth at a speed of about 15.000 mph.",
    "usescases_spysatellites_2": "collisions must be avoided at all costs, but orbital parameters cannot be revealed to other nations.",
    "usescases_spysatellites_3": "with secure multiparty computation (SMPC) even hostile nations can warn each other of collisions, without revealing orbital parameters.",
    "usescases_supplychain": "supply chain resilience",
    "usescases_supplychain_1": "to improve resilience of their supply chains and identify systemic risk, manufacturers would like to have multi-level insights into their supplier's sourcing.",
    "usescases_supplychain_2": "suppliers, on the other hand, are reluctant to provide detailed information about their sourcing strategy.",
    "usescases_supplychain_3": "with zero-knowlegde proofs weak links in supply chains can be identified without distorting competitive advantages.",
    "usescases_iot": "smart homes / IoT",
    "usescases_iot_1": "smart sensors and smart devices can help run home appliances efficiently and reduce carbon footprint.",
    "usescases_iot_2": "while aggregate data may be useful to a housing community, individual tenants do not want IoT data to leave their appartment.",
    "usescases_iot_3": "with privacy-preserving computing (PPC), data may be aggregated without revealing anything about invidivual sensors.",
    "usescases_benchmarking": "industry benchmarking",
    "usescases_benchmarking_1": "companies would like to compare their key performance indicators (KPIs) to their competitors'.",
    "usescases_benchmarking_2": "alternatively, a company would like to provide feedback to their self-employed salesforce.",
    "usescases_benchmarking_3": "in both cases, players are reluctant to reveal their individual KPIs but would benefit from joint insights and analytics.",
    "usescases_benchmarking_4": "here, privacy-preserving computation forgo an expensive trusted 3rd party and can even create live dashboards.",
    "usescases_yours": "what is your use case?",
    "usescases_yours_1": "do you have any confidential data that would become more valuable if interconnected with other parties' data?",
    "usescases_yours_2": "what kind of analytics would you want to run on the data? and what security guarantees do you require?",
    "usescases_yours_3": "talk to us and let us find out if privacy-preserving computation might be the solution to your challenge.",

    "journey": "user journey",
    "journey_usecase": "step 1 - the use case",
    "journey_usecase_1": "the user journey starts when institutions, businesses, or a group of individuals conceives an interesting <em>use case</em> (see some <ilink>/users/usecase§examples</ilink>).",
    "journey_usecase_2": "they identify some proprietary data the can not or must not share with each other, which would create <em>additional insight</em> if analysed in its entirety. the partners now want to realize the <em>potential value</em>.",
    "journey_usecase_3": "alternatively, if they have shared data so far, they now seek to design their digital collaboration in a more <em>privacy-friendly</em> way.",
    "journey_usecase_4": "in both cases, they need to <em>protect</em> their or their customers' or patients' data. they need to find a way to keep <em>control</em>, excert <em>agency</em>, and embody <em>consent<em> into their cooperation.",
    "journey_ppc": "step 2 - awareness",
    "journey_ppc_1": "with some luck, these users will discover <em>'privacy-preserving computation'</em>, a family of modern technologies based on encryption and decentralized peer-to-peer-protocols, such as:",
    "journey_ppc_2a": "<elink>https://en.wikipedia.org/wiki/Secure_multi-party_computation§secure multiparty computation</elink>",
    "journey_ppc_2b": "<elink>https://en.wikipedia.org/wiki/Homomorphic_encryption§homomorphic encryption</elink>",
    "journey_ppc_2c": "<elink>https://en.wikipedia.org/wiki/Differential_privacy§differential privacy</elink>",
    "journey_ppc_3": "these approaches are well-known to academic computer science and in the crypto community, but have not found their way into mainstream yet. there is some information to be found though:",
    "journey_ppc_4a": "<elink>https://www.accenture.com/us-en/insights/digital/maximize-collaboration-secure-data-sharing§Maximize collaboration through secure data sharing</elink>: a report by Accenture",
    "journey_ppc_4b": "<elink>http://publications.officialstatistics.org/handbooks/privacy-preserving-techniques-handbook/UN%20Handbook%20for%20Privacy-Preserving%20Techniques.pdf§UN Handbook on Privacy-Preserving Computation Techniques</elink>: a report by the Privacy Preserving Techniques Task Team of the United Nations",
    "journey_ppc_4c": "<elink>https://www.mpcalliance.org/§MPC alliance</elink>: an industry alliance of companies interested in secure multiparty computation",
    "journey_consulting": "step 3 - consulting",
    "journey_consulting_1": "companies interested in leveraging PPC for their use case should enlist the support of a consultant to help them navigate the unknown terrain.",
    "journey_consulting_2": "in a first iteration, the use case will be discussed. together, a first idea of what data to process in which way take shape. chances are the consultant will be able to identify additional value levers.",
    "journey_consulting_3": "the consultant will make a broad recommendation which technologies to look at more detail. a team is formed, a project is mandates, and a timeline is set. ideally, an end result is desribed in broad strokes.",
    "journey_planning": "step 4 - planning",
    "journey_planning_1": "the project team will now describe in greater detail:",
    "journey_planning_2a": "",
    "journey_planning_2b": "",
    "journey_planning_2c": "",
    "journey_planning_2d": "",
    "journey_planning_2e": "",
    "journey_planning_2f": "",
    "journey_planning_2g": "",
    "journey_planning_2h": "",
    "journey_planning_2i": "",
    "journey_planning_2j": "",
    "journey_planning_2k": "",
    "journey_requirements": "user requirements are quite reasonable",
    "journey_requirements1": "part of the problem stems from the fact that academic research into privacy-preserving computation has led to universal one-size-fits-all solutions which tend to be large and complex.",
    "journey_requirements2": "actual user requirements on the other hand are actually quite reasonable and could be acieved with much less overhead and complexity.",
    "journey_requirements3": "further talking to decision makers and stakeholders quickly revealed: what was available was quite different from what was really required:",
    "journey_requirements3a": "they want to solve <em>specific problems</em> and did not care about universality",
    "journey_requirements3b": "their problems are typically <em>quite simple</em> in algorithmic terms",
    "journey_requirements3c": "they do not have any crypto experts and rely on <em>generalist developers</em>",
    "journey_requirements3d": "their <em>data protection</em> officers are sceptical about novel methods",
    "journey_requirements3e": "they need a <em>precise standard</em> that could be referenced in legal documents",
    "journey_requirements3f": "they need a prototyping approach that was up to speed with their <em>CI/CD</em>",
    "journey_requirements3g": "they want a framework that was as <em>simple to operate</em> and straightforward to service",
    "journey_requirements3h": "they want to <em>collaborate</em> with others who have very different systems",
    "journey_requirements3i": "they want to choose <em>their own languages</em> and development environments",
    "journey_requirements3j": "they need the new methods to be integrated <em>step-by-step</em> into legacy code",
    "journey_approach": "a new approach",
    "journey_approach1": "<fdrtd>federated secure computing</fdrtd> is a technology designed along these requirements. it is a modern architecture based on fast and lean microservices to solve everyday problems in privacy-preserving computing.",
    "journey_approach2": "<fdrtd>fdrtd</fdrtd> is an open source reference implementation. the middleware lets users design distributed applications in a simple and easy way, and relegates all of the complex and difficult cryptography to the server or the cloud, where data protection is much easier to achieve, and computing power is abundant.",

    "solution": "solution",
    
    "benefit": "key benefits",
    "benefit_empowerment": "<em>empowerment</em>",
    "benefit_empowerment1": "we want everyone, not only cryptography experts, to be able to design, develop, deploy and manage secure distributed applications.",
    "benefit_empowerment1a": "<em>junior skills:</em> for client-side development, very basic programming skills suffice. client-side developers do not deal with cryptography at all.",
    "benefit_empowerment1b": "<em>choose your tools:</em> use whatever programming language you prefer, choose your own tech stack, bring your own toolsets. they will be fine.",
    "benefit_empowerment1c": "<em>for education:</em> our simple solution is well suited for propaedeutic exploration, student projects, and citizen science. learn privacy by doing.",
    "benefit_convenience": "<em>convenience</em>",
    "benefit_convenience1": "our technology is not yet another privacy-preserving computation framework. rather, it is a convenient middleware to run existing frameworks in the simplest manner possible:",
    "benefit_convenience1a": "<em>separation of concerns:</em> a client-server architecture separates the business logic (client-side) from the computing intensive cryptography (server-side).",
    "benefit_convenience1b": "<em>transparency:</em> application developers interact through a transparent and minimal API. control flow and data flow in peer-to-peer protocols remain transparent.",
    "benefit_convenience1c": "<em>efficiency:</em> lean and fast microservices cater to actual computing needs, without the bloat of universal monolithic solutions.",
    "benefit_convenience1d": "<em>ease of use:</em> in a modern DevSecOps and CI/CD approach, designing, implementing, deploying and managing a solution becomes easy and straightforward.",
    "benefit_compatibility": "<em>compabibility & interoperability</em>",
    "benefit_compatibility1": "compabibility & interoperability",
    "benefit_compatibility1a": "<em>standardized:</em> a free OpenAPI 3.0 standard defines the interface while remaining technology neutral and open for any protocol and 3rd party vendors.",
    "benefit_compatibility1b": "<em>runs everywhere:</em> our solution is not dependent on any tech stack, but runs everywhere, from a large cloud infrastructure to on-premises data centers, from workstations to laptops, from smartphones to IoT devices.",
    "benefit_compatibility1c": "<em>easy to integrate:</em> our solution may be implemented step by step, microservice by microservice, both greenfield or into existing legacy codebase.",

    "start": "how to start",





    "architecture": "design & architecture",
    "architecture_clientserver": "client & server architecture",
    "architecture_clientserver_a": "layers of the client & server stack",
    
    
    "middleware": "middleware & solution",

    "features": "features & extensions",

    "resources": "resources & support",
    "resources_support": "support",
    "resources_support_1": "if you need help using our source code or want to give feedback, please write an email to:",
    "resources_sourcecode": "source code",
    "resources_sourcecode_1": "find the repositories at <elink>https://github.com/fdrtd§github.com/fdrtd</elink>",
    "resources_documentation": "documentation",
    "resources_documentation_1": "find the documentation at <elink>https://fdrtd.github.io/fdrtd§fdrtd.github.io/fdrtd</elink>",
    "resources_slack": "Slack",
    "resources_slack_1": "join our Slack workspace at <elink>https://fdrtd.slack.com§fdrtd.slack.com</elink>",
    "resources_literature": "literature",
    "resources_literature_1": "Cramer R, Damgård IB, Nielsen JB: <em>Secure Multiparty Computation and Secret Sharing</em>. Cambridge 2015. <elink>https://doi.org/10.1017/CBO9781107337756§doi.org/10.1017/CBO9781107337756</elink>",
    
    "contribute": "how to contribute",
    "contribute_license": "license",
    "contribute_license1": "<fdrtd>fdrtd</fdrtd> is free and open source software.",
    "contribute_license2": "this extends to the repositories located at <elink>https://github.com/fdrtd§https://github.com/fdrtd</elink>.",
    "contribute_license3": "an appropriate <elink>https://opensource.org/licenses/MIT§MIT license</elink> is included in a <filename>LICENSE</filename> file in the root directory of all of these repositories.",
    "contribute_contributions": "contributions policy",
    "contribute_contributions1": "the project accepts contributions exclusively through <elink>https://github.com§GitHub</elink>. as per their terms of service,",
    "contribute_contributions2": "<elink>https://docs.github.com/en/github/site-policy/github-terms-of-service#6-contributions-under-repository-license§GitHub   terms of service</elink>",
    "contribute_contributions3": "'Whenever you add Content to a repository containing notice of a license, you license that Content under the same terms, and you agree that you have the right to license that Content under those terms.'",
    "contribute_contributions4": "this widely-accepted norm in the open source community reflects what both contributors and users of an open source project will expect and assume. the advantage to you, the contributor, is that the project does not need to burden you with paperwork and separate contributor license agreements (CLAs) or even copyright transfer agreements (CTAs).",
    "contribute_contributions5": "note that while you grant a license to use your contribution, you do not sign away copyright, but in fact retain full copyright for your own contribution. if you want to expressively assert your copyright by being listed in the project's <filename>CONTRIBUTORS</filename> files, please include an edit to this effect with your pull request.",
    "contribute_styleguide": "style guide",
    "contribute_styleguide_python": "<em>Python</em>",
    "contribute_styleguide_python1": "we are using lint. GitHub Actions will publish a code quality score whenever code is pushed.",
    "contribute_vulnerabilities": "vulnerabilities",
    "contribute_vulnerabilities_1": "if you found a vulnerability in our source code, please open an issue on <elink>https://github.com/fdrtd§GitHub</elink> and mark it as critical / vulnerability.",





    "news": "news",
    "news_2021-09-21": "funding by Stifterverband",
    "news_2021-09-21_a": "last Monday, we pitched our final project plan to Stifterverband (the German Donors' Association). we explained why we believe privacy-preserving computation should be available to all and how we plan to build a middleware that lowers barriers.",
    "news_2021-09-21_b": "today, Stifterverband announced that indeed Federated Secure Computing is one of ten projects to share one million Euros in funding for the next three years. they declared our project one of 'the ten best ideas to shape the German innovation, education, and science system'.",
    "news_2021-09-21_c": "the team is absolutely happy that our project can go on as planned. during the next three years we will make simple, affordable, and accessible privacy-preserving computation a reality for all institutions, companies, and individuals. thank you, Stifterverband, we promise to make you proud.",
    "news_2021-05-31": "continued support by Stifterverband",
    "news_2021-05-31_a": "during the past six month our team has received both financial support and invaluable counseling and mentorship by Stifterverband (the German Donors' Association) and its partners. their goal is to foster and promote ideas and initiatives which are expected to create substantial and lasting social benefit and to improve the German education and innovation system.",
    "news_2021-05-31_b": "we are immensely grateful to learn that the board has selected our project as one of the top 30 for the second phase of the program. during the next months we will concentrate on scalability, transferability, and sustainability of our proposition.",
    "news_2021-05-31_c": "if you want to help us create a convincing showcase, or if you are willing to contribute to the project, please contact the team. everyone is welcome.",
    "news_2021-04-03": "fdrtd is free and open source",
    "news_2021-04-03_a": "today, <fdrtd>fdrtd</fdrtd> has become free and open source. the first repositories have been published on GitHub under the MIT license.",
    "news_2021-04-03_b": "during the 'Wirkung hoch 100' mentorship, it has become clear that we may measure our success only by the systemic impact our solution creates. as a freely expandable open technology platform defined by an OpenAPI 3.0 standard, our solution is technically already very open. it naturally lends itself to become free and open source software.",
    "news_2021-04-03_c": "we believe the only way ahead in software development today is through co-creation. we invite everyone to take part in our adventure and become part of the team. together we can create not only a product, but rather a movement that changes how institutions, corporations, and individuals will deal in privacy and digital collaboration.",
    "news_2021-03-12": "successful live demonstration",
    "news_2021-03-12_a": "today, <fdrtd>fdrtd</fdrtd> was demonstrated in front of a live audience of about 70 experts from the German healtcare informatics initiative.",
    "news_2021-03-12_b": "between two university hospitals in Munich and Dresden, a simple distributed calculation was performed ad hoc. the exercise was part of a hackathon and learning experience to build capabilities at the partner sites across Germany.",
    "news_2021-03-12_c": "UPDATE June 2021: in the meantime, different alpha versions have been successfully tested by six or more university hospitals.",
    "news_2021-03-11": "public test servers are live",
    "news_2021-03-11_a": "for the convenience of users who want to test <fdrtd>fdrtd</fdrtd>, there are public test servers available now. without the need to set up and run their own servers, scientists and developers may test our technology in minutes.",
    "news_2021-03-11_b": "the test servers will be regularly updated with the latest development build. they are completely open without authentication, so for security and privacy reasons, some functionality has been removed, and no personal data may be uploaded.",
    "news_2021-03-11_c": "our first batch of five public test servers is kindly provided to the scientific community by Leibniz Rechenzentrum (LRZ), one of the leading supercomputing facilities in Europe. additional servers for commercial enterprises will be provided on the infrastructure of Amazon Web Services.",
    "news_2020-12-02": "bytes for life founded",
    "news_2020-12-02_a": "bytes for life GmbH is a spin-off of LMU Munich. it provides consulting in the area of technology transfer as well as software development with a focus on SaaS and cloud computing.",
    "news_2020-12-02_b": "the start-up will sponsor <fdrtd>fdrtd</fdrtd> and provide the necessary legal, financial, and operational framework such as team building, website hosting, human support, community events, and general oversight.",
    "news_2020-11-09": "Stifterverband supports Federated Secure Computing",
    "news_2020-11-09_a": "'Wirkung hoch 100' is a program by Stifterverband, the German Donor's Association. in its 100th year of operation, they decided to identify and support 100 ideas that have the potential to benefit the German education and innovation ecosystem.",
    "news_2020-11-09_b": "out of over 500 applications, <fdrtd>Federated Secure Computing</fdrtd> was selected to be one of the promoted projects. during the coming months we will receive funding and mentorship and will co-create with other teams what we believe is intelligent data protection made in Germany.",
    "news_2020-11-09_c": "our job is to make privacy preserving computation available to all by reducing barriers and creating awareness. we are thrilled to meet the other teams and even more motivated to push our development ahead.",
    "news_2020-03-02": "mobile and cloud boost secure distributed computing",
    "news_2020-03-02_a": "an early prototype of our technology demonstrates the benefits of a lean client-server architecture in the context of secure distributed computing.",
    "news_2020-03-02_b": "as a benchmark, we looked at a traditional secure multiparty computation solution we had devised earlier. the setup included two Intel Xeon servers, each 8 cores, 2.6 GHz, 128 GB RAM, and 1 Gb/s networking via fast internet backbone between university hospitals in Munich and Berlin. its devops required two systems administrators and one expert programmer for several weeks.",
    "news_2020-03-02_c": "by comparison, our early prototype ran on a Samsung Galaxy XCover 4, took 15 minutes to develop for a total of 9 lines of Python code, and executed a homomorphic encryption protocol via the public 4G mobile cell phone network, leveraging the server-side computing power of AWS Frankfurt.",
    "news_2020-03-02_d": "the result was exact to machine precision and took 4.5 seconds to compute, compared to 1,229 seconds of the original solution (speedup 10^2 ... 10^3).",
    
    "pitch": "pitch",
    "pitch_beliefs": "our beliefs",
    "pitch_beliefs1": "we believe that it is only through <em>collaboration, not isolation</em>, that society, researchers, corporations, and individuals will make best use of their proprietary data and capture their full value.",
    "pitch_beliefs2": "we understand that <em>privacy-preserving computation</em> enables efficient collaboration while still preserving control, custody, trust, agency, consent, and privacy.",
    "pitch_beliefs3": "we envision transformative use cases for <fdrtd>federated secure computing</fdrtd> throughout industries and practises, whenever one must not, want not or can not share their data with partners and competitors.",
    "pitch_beliefs4": "we are convinced <em>decentralised data storage and peer-to-peer data flow</em> will make for faster, better, more resilient and ultimatively more sustainable and more democratic information infrastructure.",
    "pitch_beliefs5": "we <em>challenge current barriers</em> to entry and we do not accept that privacy-preserving computation should be difficult to develop, exclusive and expensive to own, or cumbersome to operate.",
    "pitch_mission": "our mission",
    "pitch_mission1": "we <em>empower everyone</em> to engage in privacy-preserving computation and help them implement their use cases.",
    "pitch_mission2": "we advocated <fdrtd>Federated Secure Computing</fdrtd>, a free and open standard and a <em>modern architecture</em> to render secure computing easy and convenient.",
    "pitch_mission3": "we provide <fdrtd>fdrtd</fdrtd>, our <em>free and open source</em> reference implementation as a starting point for feature-rich solutions.",
    "pitch_mission4": "we foster an <em>ecosystem and a community</em> for users and developers to share and learn.",
    "pitch_mission5": "we help you design <em>convincing show cases</em> and support you in building secure applications.",
    
    "acknowledgements": "acknowledgements",
    "acknowledgements_sponsors": "sponsors and supporters",
    "acknowledgements_sponsors_": "the <fdrtd>fdrtd</fdrtd> project would like to express its heartfelt thanks to its sponsors and supporters:",
    "acknowledgements_stifterverband": "<elink>https://www.stifterverband.org§Stifterverband</elink> (German donors' association) financially supports the project and provides invaluable counseling and mentoring through its <elink>https://www.stifterverband.org/wirkunghoch100§Wirkung hoch 100</elink> initiative. during this program, federated secure computing was selected as one of the top 30 ideas for the future of the German education, science and innovation ecosystem.",
    "acknowledgements_bytesforlife": "<elink>https://www.bytesforlife.com§bytes for life GmbH</elink> is a spin-off of LMU Munich. it provides consulting in the area of technology transfer as well as software development with a focus on SaaS and cloud computing. the start-up sponsors <fdrtd>fdrtd</fdrtd> and provides the necessary legal, financial, and operational framework such as team building, website hosting, human support, community events, and general oversight.",
    "acknowledgements_lrz": "<elink>https://www.lrz.de§Leibniz-Rechenzentrum</elink> of the Bavarian Academy of Sciences is one of the European super computing facilities. among other services, they provide a very flexible and convenient cloud infrastructure. through the project's affiliation with LMU Munich their <elink>https://doku.lrz.de/display/PUBLIC/Compute+Cloud§LRZ Compute Cloud</elink> hosts our test servers for the scientific community.",
    "acknowledgements_tools": "3rd party software",
    "acknowledgements_tools_": "the <fdrtd>fdrtd</fdrtd> project could be built thanks to a stack of amazing tech:",
    "acknowledgements_gatsby": "<elink>https://www.gatsbyjs.com§Gatsby</elink>, a dynamic site generator, was used to build this website",
    "acknowledgements_github": "<elink>https://www.github.com§GitHub</elink> provides free open source repositories and great collaboration tools",
    "acknowledgements_jetbrains": "<elink>https://www.jetbrains.com§JetBrains</elink> provides free community edition IDEs for multiple programming languages",
    "acknowledgements_openapi": "<elink>https://www.openapis.org§OpenAPI</elink> specification and Swagger UI tools",
    "acknowledgements_vscode": "<elink>https://code.visualstudio.com§Visual Studio Code</elink> was used for website design and editing",

    "media": "press & media",
    "media_clippings": "press clippings",
    "media_clippings_1": "↗ <elink>https://www.aerzteblatt.de/nachrichten/103090/Innovatives-IT-Verfahren-soll-sensible-Daten-in-der-Krebsforschung-schuetzen§Ärzteblatt: Innovatives IT-Verfahren soll sensible Daten in der Krebsforschung schützen</elink>",
    "media_releases": "press releases",
    "media_releases_1": "↗ <elink>https://www.stifterverband.org/pressemitteilungen/2020_11_09_wirkung_hoch_100§Stifterverband: Das sind die 100 besten Ideen Deutschlands für Bildung, Wissenschaft und Innovation</elink>",
    "media_releases_2": "↗ <elink>https://www.stifterverband.org/pressemitteilungen/2021_05_31_wirkung_hoch_100§Stifterverband: Jubiläumsinitiative des Stifterverbandes startet mit 30 Projekten in zweite Förderphase</elink>",
    "media_releases_3": "↗ <elink>https://www.stifterverband.org/pressemitteilungen/2021_09_21_wirkung_hoch_100§Stifterverband: Eine Million Euro für die zehn besten Ideen in Bildung, Wissenschaft und Innovation</elink>",
    "media_releases_4": "↗ <elink>https://www.lmu.de/en/newsroom/news-overview/news/news-detailseite_48128.html§LMU: Two projects on innovation and education funded</elink>",
    "media_downloads": "downloads",
    "media_logo_dark": "logo for dark backgrounds (<dlink>/home/media/logo_dark.png§download</ilink>, 406 x 406 pixels, 14 KB)",
    "media_logo_light": "logo for light backgrounds (<dlink>/home/media/logo_light.png§download</ilink>, 406 x 406 pixels, 12 KB)",

    "contact": "contact",
    "contact_coordinator": "coordinator",
    "contact_coordinator_1": "Hendrik Ballhausen",
    "contact_coordinator_2": "<elink>mailto:ballhausen@bytesforlife.com§ballhausen@bytesforlife.com</elink>",
    "contact_communitymanager": "community manager",
    "contact_communitymanager_1": "Elisabeth Bießlich-Keller",
    "contact_communitymanager_2": "<elink>mailto:e.keller@med.uni-muenchen.de§e.keller@med.uni-muenchen.de</elink>",
    




    "legal_privacy_heading": "privacy policy",
    "legal_privacy_a": "personal data",
    "legal_privacy_a1": "Personal data (usually referred to just as “data” below) will only be processed by us to the extent necessary and for the purpose of providing a functional and user-friendly website, including its contents, and the services offered there.",
    "legal_privacy_a2": "Per Art. 4 No. 1 of Regulation (EU) 2016/679, i.e. the General Data Protection Regulation (hereinafter referred to as the “GDPR”), “processing” refers to any operation or set of operations such as collection, recording, organization, structuring, storage, adaptation, alteration, retrieval, consultation, use, disclosure by transmission, dissemination, or otherwise making available, alignment, or combination, restriction, erasure, or destruction performed on personal data, whether by automated means or not.",
    "legal_privacy_a3": "The following privacy policy is intended to inform you in particular about the type, scope, purpose, duration, and legal basis for the processing of such data either under our own control or in conjunction with others. We also inform you below about the third-party components we use to optimize our website and improve the user experience which may result in said third parties also processing data they collect and control.",
    "legal_privacy_a4": "Our privacy policy is structured as follows:",
    "legal_privacy_b": "I. Information about us as controllers of your data",
    "legal_privacy_b1": "the party responsible for this website (the “controller”) for purposes of data protection law is:",
    "legal_privacy_b2": "bytes for life GmbH",
    "legal_privacy_b3": "Kaulbachstrasse 61a",
    "legal_privacy_b4": "80539 Munich",
    "legal_privacy_b5": "Germany",
    "legal_privacy_b6": "telephone: +49 – 176 – 38 23 92 81",
    "legal_privacy_b7": "email: <elink>mailto:mail@bytesforlife.com§mail@bytesforlife.com</elink>",
    "legal_privacy_b8": "website: <elink>https://www.bytesforlife.com§www.bytesforlife.com</elink>",
    "legal_privacy_c": "II. The rights of users and data subjects",
    "legal_privacy_c1": "With regard to the data processing to be described in more detail below, users and data subjects have the right",
    "legal_privacy_c2": "to confirmation of whether data concerning them is being processed, information about the data being processed, further information about the nature of the data processing, and copies of the data (cf. also Art. 15 GDPR);",
    "legal_privacy_c3": "to correct or complete incorrect or incomplete data (cf. also Art. 16 GDPR);",
    "legal_privacy_c4": "to the immediate deletion of data concerning them (cf. also Art. 17 DSGVO), or, alternatively, if further processing is necessary as stipulated in Art. 17 Para. 3 GDPR, to restrict said processing per Art. 18 GDPR;",
    "legal_privacy_c5": "to receive copies of the data concerning them and/or provided by them and to have the same transmitted to other providers/controllers (cf. also Art. 20 GDPR);",
    "legal_privacy_c6": "to file complaints with the supervisory authority if they believe that data concerning them is being processed by the controller in breach of data protection provisions (see also Art. 77 GDPR).",
    "legal_privacy_c7": "In addition, the controller is obliged to inform all recipients to whom it discloses data of any such corrections, deletions, or restrictions placed on processing the same per Art. 16, 17 Para. 1, 18 GDPR. However, this obligation does not apply if such notification is impossible or involves a disproportionate effort. Nevertheless, users have a right to information about these recipients.",
    "legal_privacy_c8": "Likewise, under Art. 21 GDPR, users and data subjects have the right to object to the controller’s future processing of their data pursuant to Art. 6 Para. 1 lit. f) GDPR. In particular, an objection to data processing for the purpose of direct advertising is permissible.",
    "legal_privacy_d": "III. Information about the data processing",
    "legal_privacy_d1": "Your data processed when using our website will be deleted or blocked as soon as the purpose for its storage ceases to apply, provided the deletion of the same is not in breach of any statutory storage obligations or unless otherwise stipulated below.",
    "legal_privacy_d2": "Server data",
    "legal_privacy_d3": "For technical reasons, the following data sent by your internet browser to us or to our server provider will be collected, especially to ensure a secure and stable website: These server log files record the type and version of your browser, operating system, the website from which you came (referrer URL), the webpages on our site visited, the date and time of your visit, as well as the IP address from which you visited our site.",
    "legal_privacy_d4": "The data thus collected will be temporarily stored, but not in association with any other of your data.",
    "legal_privacy_d5": "The basis for this storage is Art. 6 Para. 1 lit. f) GDPR. Our legitimate interest lies in the improvement, stability, functionality, and security of our website.",
    "legal_privacy_d6": "The data will be deleted within no more than seven days, unless continued storage is required for evidentiary purposes. In which case, all or part of the data will be excluded from deletion until the investigation of the relevant incident is finally resolved.",
    "legal_privacy_d7": "Cookies",
    "legal_privacy_d8": "This website does not use cookies.",
    "legal_privacy_d9": "Contact",
    "legal_privacy_d10": "If you contact us via email or the contact form, the data you provide will be used for the purpose of processing your request. We must have this data in order to process and answer your inquiry; otherwise we will not be able to answer it in full or at all.",
    "legal_privacy_d11": "The legal basis for this data processing is Art. 6 Para. 1 lit. b) GDPR.",
    "legal_privacy_d12": "Your data will be deleted once we have fully answered your inquiry and there is no further legal obligation to store your data, such as if an order or contract resulted therefrom.",
    "legal_privacy_footer": "this privacy policy was derived from the <elink>https://www.ratgeberrecht.eu/leistungen/muster-datenschutzerklaerung.html§Model Data Protection Statement</elink> by <elink>https://www.ratgeberrecht.eu§Anwaltskanzlei Weiß & Partner</elink>.",

    "legal_contact_heading": "contact",
    "legal_contact_a": "information as per German Telemedia Act section 5",
    "legal_contact_a1": "bytes for life GmbH",
    "legal_contact_a2": "Kaulbachstrasse 61a",
    "legal_contact_a3": "80539 Munich",
    "legal_contact_a4": "Germany",
    "legal_contact_a5": "phone: +49 – 176 – 38 23 92 81",
    "legal_contact_a6": "email: <elink>mailto:mail@bytesforlife.com§mail@bytesforlife.com</elink>",
    "legal_contact_a7": "website: <elink>https://www.bytesforlife.com§www.bytesforlife.com</elink>",
    "legal_contact_a8": "registry court, registry number",
    "legal_contact_a9": "District Court Munich, HRB 262175",
    "legal_contact_a10": "managing director",
    "legal_contact_a11": "Dr. Hendrik Ballhausen",
    "legal_contact_a12": "sales tax ID",
    "legal_contact_a13": "DE 338 44 66 35"
}
