{
    "title": "fdrtd - secure distributed computing",
    
    "404_not_found": "404 page not found",

    "general_source": "source",
    "general_imagecredit": "image credit",

    "nav_why": "background",
    "nav_how": "our technology",
    "nav_what": "for developers",
    
    "nav_about": "about",
    "nav_about_news": "news",
    "nav_about_teaser": "executive summary",
    "nav_about_story": "about us",
    "nav_about_milestones": "milestones",
    "nav_about_acknowledgements": "acknowledgements",
    "nav_about_faq": "FAQ",

    "nav_motivation": "motivation",
    "nav_motivation_data": "the value of data",
    "nav_motivation_privacy": "the value of privacy",
    "nav_motivation_tradeoffs": "traditional tradeoffs",
    "nav_motivation_cryptography": "cryptography",
    "nav_motivation_challenges": "challenges",
    "nav_motivation_designgoals": "design goals",

    "nav_usecases": "use cases",
    "nav_usecases_it": "IT & telecom",
    "nav_usecases_healthcare": "health care",
    "nav_usecases_retail": "retail & PoS",
    "nav_usecases_finance": "finance",
    "nav_usecases_energyutility": "energy & utility",
    "nav_usecases_publicsector": "public sector",

    "nav_technology": "federated secure computing",
    "nav_technology_federation": "federation & separation",
    "nav_technology_clientserver": "client & server architecture",
    "nav_technology_microservices": "fast & lean microservices",
    "nav_technology_platform": "platform & ecosystem",
    "nav_technology_cloud": "ready for cloud & IoT",
    "nav_technology_openapi": "OpenAPI 3.0 standard",

    "nav_solution": "reference solution",
    "nav_solution_fdrtd": "fdrtd & fdrtd server",
    "nav_solution_protocols": "supported protocols",
    "nav_solution_usecases": "supported use cases",
    "nav_solution_features": "features & perks",
    "nav_solution_plugandplay": "plug & play extensibility",
    "nav_solution_foss": "free & open source",

    "nav_clientside": "client-side development",
    "nav_clientside_explanation": "explanation",
    "nav_clientside_tutorials": "tutorials",
    "nav_clientside_howto": "how-to guides",
    "nav_clientside_reference": "reference",
    "nav_clientside_library": "microservice library",
    "nav_clientside_apibrowser": "API browser",

    "nav_serverside": "server-side development",
    "nav_serverside_explanation": "explanation",
    "nav_serverside_tutorials": "tutorials",
    "nav_serverside_howto": "how-to guides",
    "nav_serverside_reference": "reference",
    "nav_serverside_stub": "server stub",
    "nav_serverside_devsecops": "dev-sec-ops",

    "nav_resources": "resources",
    "nav_resources_sourcecode": "source code",
    "nav_resources_support": "support",
    "nav_resources_community": "community",
    "nav_resources_science": "science",
    "nav_resources_styleguide": "styleguide",
    "nav_resources_license": "license & contributions",

    "nav_language_select": "language",
    "nav_language_en": "English",
    "nav_language_de": "German",

    "nav_theme_select": "theme",
    "nav_theme_dark": "dark mode",
    "nav_theme_light": "day mode",
    "nav_theme_highcontrast": "high contrast",

    "nav_legal": "legal",
    "nav_legal_privacy": "privacy",
    "nav_legal_contact": "contact",

    "home": "home",
    "home_a": "welcome",
    "home_a1": "<em>WHY // </em>we want to create awareness that digital collaboration is possible without data sharing through modern cryptography ('privacy preserving computation'). we want to help you leverage the full value of your data while retaining full control, ownership, and agency. we want to reduce barriers and empower everyone by removing the traditional overhead and complexity of integrating crypto with application development.",
    "home_a2": "<em>HOW // </em>our innovative architecture <fdrtd>Federated Secure Computing</fdrtd> lets you easily design distributed application client-side, while offloading all of the difficult and computing intensive cryptography server-side. it is based on fast and lean microservices and is described by a Open API 3.0 standard. as a plug &amp; play open technology platform, it orchestrates various protocols with or without a central 3rd party (e.g. homomorphic encryption or secure multiparty computation).",
    "home_a3": "<em>WHAT // </em>to get you jump started, we provide <fdrtd>fdrtd</fdrtd> (read: federated), a free and open source library. it runs just about anywhere, on premises, in the cloud or on the smallest IoT device. it lets you connect with your collaborators irrespective of their choice of operating system, programming language or technology stack. it provides simple reference implementations for various crypto protocols and application microservices.",
    "home_a4": "<em>WHO // </em>this is about you. we want to empower everyone, be it institutions, corporations, or individuals, to build and run great distributed applications. we want to create a community of users and developers to exchange and learn. whether you want to protect your customers' data, shrink your attack surface, or design next-generation distributed apps, we are here to help you. we welcome your use cases, irrespective of industry and function, and help you create visible show cases. if you want to improve on our humble beginnings, we welcome you as a contributor of our open source project. join us.",

    "resources_license": "license & contributions",
    "resources_license_a": "license",
    "resources_license_a1": "<fdrtd>fdrtd</fdrtd> is free and open source software.",
    "resources_license_a2": "this extends to the repositories located at <elink>https://github.com/fdrtd§https://github.com/fdrtd</elink>.",
    "resources_license_a3": "an appropriate <elink>https://opensource.org/licenses/MIT§MIT license</elink> is included in a <filename>LICENSE</filename> file in the root directory of all of these repositories.",
    "resources_license_b": "contributions",
    "resources_license_b1": "the project accepts contributions exclusively through <elink>https://github.com§GitHub</elink>. as per their terms of service,",
    "resources_license_b2": "<elink>https://docs.github.com/en/github/site-policy/github-terms-of-service#6-contributions-under-repository-license§GitHub   terms of service</elink>",
    "resources_license_b3": "'Whenever you add Content to a repository containing notice of a license, you license that Content under the same terms, and you agree that you have the right to license that Content under those terms.'",
    "resources_license_b4": "this widely-accepted norm in the open source community reflects what both contributors and users of an open source project will expect and assume. the advantage to you, the contributor, is that the project does not need to burden you with paperwork and separate contributor license agreements (CLAs) or even copyright transfer agreements (CTAs).",
    "resources_license_b5": "note that while you grant a license to use your contribution, you do not sign away copyright, but in fact retain full copyright for your own contribution. if you want to expressively assert your copyright by being listed in the project's <filename>CONTRIBUTORS</filename> files, please include an edit to this effect with your pull request.",

    "resources_support": "support",
    "resources_support_a": "on GitHub",
    "resources_support_a1": "something not working as expected? some great feature missing? found a bug?",
    "resources_support_a2": "the best way to make the coding team aware is to create an issue on GitHub. everyone will be on board, and your suggestion can be discussed. even better, you and others can directly contribute to the code. creating an issue is the preferred way before sending a pull request.",
    "resources_support_b": "by email",
    "resources_support_b1": "need help with an on-premises installation? thinking about a new use case?",
    "resources_support_b2": "if your question or problem does not concern everyone on the project, then the best way to get individual support is to send an email. our team is here to help, and you will usually get a response within 24 hours.",

    "legal_privacy_heading": "privacy policy",
    "legal_privacy_a": "personal data",
    "legal_privacy_a1": "Personal data (usually referred to just as “data” below) will only be processed by us to the extent necessary and for the purpose of providing a functional and user-friendly website, including its contents, and the services offered there.",
    "legal_privacy_a2": "Per Art. 4 No. 1 of Regulation (EU) 2016/679, i.e. the General Data Protection Regulation (hereinafter referred to as the “GDPR”), “processing” refers to any operation or set of operations such as collection, recording, organization, structuring, storage, adaptation, alteration, retrieval, consultation, use, disclosure by transmission, dissemination, or otherwise making available, alignment, or combination, restriction, erasure, or destruction performed on personal data, whether by automated means or not.",
    "legal_privacy_a3": "The following privacy policy is intended to inform you in particular about the type, scope, purpose, duration, and legal basis for the processing of such data either under our own control or in conjunction with others. We also inform you below about the third-party components we use to optimize our website and improve the user experience which may result in said third parties also processing data they collect and control.",
    "legal_privacy_a4": "Our privacy policy is structured as follows:",
    "legal_privacy_b": "I. Information about us as controllers of your data",
    "legal_privacy_b1": "the party responsible for this website (the “controller”) for purposes of data protection law is:",
    "legal_privacy_b2": "bytes for life GmbH",
    "legal_privacy_b3": "Kaulbachstrasse 61a",
    "legal_privacy_b4": "80539 Munich",
    "legal_privacy_b5": "Germany",
    "legal_privacy_b6": "telephone: +49 – 176 – 38 23 92 81",
    "legal_privacy_b7": "email: <elink>mailto:mail@bytesforlife.com§mail@bytesforlife.com</elink>",
    "legal_privacy_b8": "website: <elink>https://www.bytesforlife.com§www.bytesforlife.com</elink>",
    "legal_privacy_c": "II. The rights of users and data subjects",
    "legal_privacy_c1": "With regard to the data processing to be described in more detail below, users and data subjects have the right",
    "legal_privacy_c2": "to confirmation of whether data concerning them is being processed, information about the data being processed, further information about the nature of the data processing, and copies of the data (cf. also Art. 15 GDPR);",
    "legal_privacy_c3": "to correct or complete incorrect or incomplete data (cf. also Art. 16 GDPR);",
    "legal_privacy_c4": "to the immediate deletion of data concerning them (cf. also Art. 17 DSGVO), or, alternatively, if further processing is necessary as stipulated in Art. 17 Para. 3 GDPR, to restrict said processing per Art. 18 GDPR;",
    "legal_privacy_c5": "to receive copies of the data concerning them and/or provided by them and to have the same transmitted to other providers/controllers (cf. also Art. 20 GDPR);",
    "legal_privacy_c6": "to file complaints with the supervisory authority if they believe that data concerning them is being processed by the controller in breach of data protection provisions (see also Art. 77 GDPR).",
    "legal_privacy_c7": "In addition, the controller is obliged to inform all recipients to whom it discloses data of any such corrections, deletions, or restrictions placed on processing the same per Art. 16, 17 Para. 1, 18 GDPR. However, this obligation does not apply if such notification is impossible or involves a disproportionate effort. Nevertheless, users have a right to information about these recipients.",
    "legal_privacy_c8": "Likewise, under Art. 21 GDPR, users and data subjects have the right to object to the controller’s future processing of their data pursuant to Art. 6 Para. 1 lit. f) GDPR. In particular, an objection to data processing for the purpose of direct advertising is permissible.",
    "legal_privacy_d": "III. Information about the data processing",
    "legal_privacy_d1": "Your data processed when using our website will be deleted or blocked as soon as the purpose for its storage ceases to apply, provided the deletion of the same is not in breach of any statutory storage obligations or unless otherwise stipulated below.",
    "legal_privacy_d2": "Server data",
    "legal_privacy_d3": "For technical reasons, the following data sent by your internet browser to us or to our server provider will be collected, especially to ensure a secure and stable website: These server log files record the type and version of your browser, operating system, the website from which you came (referrer URL), the webpages on our site visited, the date and time of your visit, as well as the IP address from which you visited our site.",
    "legal_privacy_d4": "The data thus collected will be temporarily stored, but not in association with any other of your data.",
    "legal_privacy_d5": "The basis for this storage is Art. 6 Para. 1 lit. f) GDPR. Our legitimate interest lies in the improvement, stability, functionality, and security of our website.",
    "legal_privacy_d6": "The data will be deleted within no more than seven days, unless continued storage is required for evidentiary purposes. In which case, all or part of the data will be excluded from deletion until the investigation of the relevant incident is finally resolved.",
    "legal_privacy_d7": "Cookies",
    "legal_privacy_d8": "This website does not use cookies.",
    "legal_privacy_d9": "Contact",
    "legal_privacy_d10": "If you contact us via email or the contact form, the data you provide will be used for the purpose of processing your request. We must have this data in order to process and answer your inquiry; otherwise we will not be able to answer it in full or at all.",
    "legal_privacy_d11": "The legal basis for this data processing is Art. 6 Para. 1 lit. b) GDPR.",
    "legal_privacy_d12": "Your data will be deleted once we have fully answered your inquiry and there is no further legal obligation to store your data, such as if an order or contract resulted therefrom.",
    "legal_privacy_footer": "this privacy policy was derived from the <elink>https://www.ratgeberrecht.eu/leistungen/muster-datenschutzerklaerung.html§Model Data Protection Statement</elink> by <elink>https://www.ratgeberrecht.eu/datenschutz/datenschutzerklaerung-generator-dsgvo.html§Anwaltskanzlei Weiß & Partner</elink>",

    "legal_contact_heading": "contact",
    "legal_contact_a": "information as per German Telemedia Act section 5",
    "legal_contact_a1": "bytes for life GmbH",
    "legal_contact_a2": "Kaulbachstrasse 61a",
    "legal_contact_a3": "80539 Munich",
    "legal_contact_a4": "Germany",
    "legal_contact_a5": "phone: +49 – 176 – 38 23 92 81",
    "legal_contact_a6": "email: <elink>mailto:mail@bytesforlife.com§mail@bytesforlife.com</elink>",
    "legal_contact_a7": "website: <elink>https://www.bytesforlife.com§www.bytesforlife.com</elink>",
    "legal_contact_a8": "registry court, registry number",
    "legal_contact_a9": "District Court Munich, HRB 262175",
    "legal_contact_a10": "managing director",
    "legal_contact_a11": "Dr. Hendrik Ballhausen",
    "legal_contact_a12": "sales tax ID",
    "legal_contact_a13": "DE 338 44 66 35"
}
